[
  {
    "outcome_id": "DE:6:DE.6.1.H1.1",
    "code": "DE.6.1.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können ihr Vorwissen über Freizeitaktivitäten und Hobbys aktivieren und ordnen die visuellen und sprachlichen Impulse ein. Sie können erste Vermutungen zum Material für Hör/Sehverstehen äußern. DE.6.1.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können gezielt zuhören bzw. zusehen, um wichtige Details aus einem Text für Hör/Sehverstehen zum Thema Hobbys zu entnehmen, zu verstehen und weiterzuverarbeiten DE.6.1.P3.1. - Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale Laute, Lautverbindungen, Betonungsmuster und Intonationsformen im Zusammenhang mit Freizeitaktivitäten und Hobbys erkennen und üben. Sie können Wörter und Sätze deutlich, rhythmisch und altersgerecht aussprechen. DE.6.1.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können ihr Vorwissen, erkennen thematische Zusammenhänge aktivieren und stellen erste Leseerwartungen. DE.6.1.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können zentrale Informationen aus Texten zum Thema Hobbys entnehmen und vergleichen diese mit ihren eigenen Vorlieben und Meinungen. DE.6.1.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können zentrale Wörter zum Thema Hobbys erkennen und verstehen und können sie aktiv in einfachen mündlichen und schriftlichen Äußerungen verwenden. DE.6.1.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen zur Beschreibung von Freizeitaktivitäten erkennen und können sie bei der Meinungsäußerung verwenden. DE.6.1.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf das Schreiben einfacher Texte über ihre Hobbys und Freizeitaktivitäten vorbereiten und können kurze strukturierte Texte dazu verfassen. DE.6.1.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich und inhaltlich auf das Sprechen über ihre Hobbys und Freizeitaktivitäten vorbereiten und können erste gestützte Sprechaufgaben durchführen. DE.6.1.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können über ihre Freizeitaktivitäten sprechen, beteiligen sich an kooperativen und kreativen Sprechaufgaben und reflektieren ihre mündliche Ausdrucksfähigkeit.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 4,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:6:DE.6.2.H1.1",
    "code": "DE.6.2.H1.1",
    "statement": "– Vorbereitung auf das Hör-und Sehverstehen Lernziel: Die Schüler können ihr Vorwissen zu Tagesablauf und Uhrzeiten aktivieren, können visuelle und sprachliche Impulse ordnen und Vermutungen zum Hör-/Sehverstehen stellen. DE.6.2.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können gezielt Informationen aus Materialien von Hör/Sehverstehen zu Tagesablauf und Uhrzeiten entnehmen und können zentrale Aussagen verstehen. DE.6.2.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale phonologische Elemente erkennen und üben, die für die Kommunikation über den Tagesablauf und die Uhrzeiten wichtig sind. DE.6.2.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf das Lesen von Texten über den Tagesablauf vorbereiten, aktivieren Vorwissen und entwickeln Erwartungen an den Text. DE.6.2.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen die Hauptinformationen, Detailangaben zu Tagesabläufen erfassen und können persönliche Bezüge zu ihrem eigenen Alltag herstellen. DE.6.2.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den thematischen Zielwortschatz rund um Tageszeiten, Uhrzeiten und Alltagsaktivitäten korrekt in schriftlichen und mündlichen Kontexten erkennen und verwenden. DE.6.2.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können zielgerichtet die grammatischen Strukturen erkennen und verwenden, um den Tagesablauf sprachlich korrekt und situationsangemessen zu beschreiben. DE.6.2.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können einfache schriftliche Texte über ihren eigenen Tagesablauf unter Verwendung des Zielwortschatzes und der Zielgrammatik planen und verfassen. DE.6.2.SP3.1.– Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich auf Gespräche über ihren Tagesablauf vorbereiten und können mit Unterstützung über vertraute Routinen und Uhrzeiten sprechen. DE.6.2.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können strukturiert über ihren Tagesablauf berichten. Sie können mit Mitschülern ihren Tagesablauf austauschen und reflektieren ihre mündliche Ausdrucksfähigkeit.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 12,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 15,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 20,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:6:DE.6.3.H1.1",
    "code": "DE.6.3.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können ihr Vorwissen sprachlich aufwecken und können sich visuell auf das Hör/Sehverstehen zum Thema „Die Jahreszeiten und das Wetter“ vorbereiten. DE.6.3.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können gezielt Informationen zu Jahreszeiten, Wetterbedingungen und Kleidung aus Materialien für Hör- oder Sehverstehen entnehmen. DE.6.3.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale phonologische Merkmale im Zusammenhang mit der Lektion „Die Jahreszeiten und das Wetter“ erkennen und üben, um ihre Aussprache und ihr Hörverstehen zu verbessern. DE.6.3.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können gezielt Informationen zu den Jahreszeiten, Monaten, dem Wetter und typischer Kleidung aus kurzen Lesetexten oder Schaubildern entnehmen. DE.6.3.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können Informationen zu Wetter und Jahreszeiten strukturieren und vergleichen. Sie können eigene Gedanken und Gefühle äußern und reflektieren ihren persönlichen Bezug zum Thema. DE.6.3.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den thematischen Wortschatz zu den Jahreszeiten, Monaten, dem Wetter und der Kleidung erweitern und festigen. Sie können diesen Wortschatz gezielt in mündlichen und schriftlichen Situationen verwenden. DE.6.3.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen im Zusammenhang mit dem Thema „Die Jahreszeiten und das Wetter“ erkennen und verwenden. Sie können einfache Sätze zur Beschreibung von Wetter, Kleidung und Aktivitäten bilden. DE.6.3.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich systematisch auf das Schreiben einfacher Texte zum Thema „Die Jahreszeiten und das Wetter“ vorbereiten und können strukturierte, altersgerechte Texte verfassen. DE.6.3.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich und inhaltlich auf Gespräche zum Thema „Die Jahreszeiten und das Wetter“ vorbereiten. DE.6.3.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können mithilfe von Satzmustern, Bildkarten oder Dialogvorlagen über Wetter, Jahreszeiten und passende Kleidung sprechen. Die Schüler können freie Gespräche und interaktive Sprechaufgaben zu Wetter und Jahreszeiten durchführen.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 23,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 28,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 31,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:6:DE.6.4.H1.1",
    "code": "DE.6.4.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können ihr Vorwissen zum Thema „Mein Zuhause“ aktivieren, können bekannte Wohnräume, Möbel und Gegenstände benennen und können sich sprachlich und visuell auf Situationen für Hör- und Sehverstehen vorbereiten. DE.6.4.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können aus Situationen von Hör/Sehverstehen gezielt Informationen zu Wohnräumen, Möbelstücken und Gegenständen entnehmen. DE.6.4.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können typische Lautverbindungen und Intonationsmuster im Kontext von „Mein Zuhause“ erkennen und üben. DE.6.4.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Leseverstehen zum Thema „Mein Zuhause“ vorbereiten, um vertraute Redemittel und zentrale Informationen zum eigenen Zuhause zu erkennen und zu deuten. DE.6.4.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen gezielt Informationen zum Thema „Mein Zuhause“ und formulieren eigene Beschreibungen entnehmen. DE.6.4.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Zielwortschatz zum Thema „Mein Zuhause“ gezielt erkennen und situationsgerecht, spontan und angemessen in der mündlichen und schriftlichen Kommunikation anwenden. DE.6.4.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die grammatischen Zielstrukturen zum Thema „Mein Zuhause“ erkennen und sie situationsgerecht, spontan und angemessen in der mündlichen und schriftlichen Kommunikation anwenden. DE.6.4.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema „Mein Zuhause“ vorbereiten, eigene Inhalte planen und strukturierte, themenbezogene Texte verfassen. DE.6.4.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den Sprechprozess zum Thema „Mein Zuhause“ vorbereiten, um vertraute Redemittel, Satzmuster und Wortschatz sicher anwenden DE.6.4.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können selbstständig und spontan über ihr Zuhause sprechen. Sie können dabei die gelernten Redemittel nutzen und flexibel in Gesprächssituationen reagieren.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 37,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:6:DE.6.5.H1.1",
    "code": "DE.6.5.H1.1",
    "statement": "– Vorbereitung auf das Hör-und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Hör-/Sehverstehen zu den Themen „Die Geschäfte in der Stadt“, „Die Orientierung in der Stadt“ und „Die Wegbeschreibung“ vorbereiten, um vertraute Redemittel, Richtungsangaben, Ortsangaben und einfache Wegbeschreibungen zu erkennen und zu deuten. DE.6.5.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen „Die Geschäfte in der Stadt“, „Die Orientierung in der Stadt“ und „Die Wegbeschreibung“ erkennen und verstehen. DE.6.5.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale phonologische Zielstrukturen zum Thema „Meine Umgebung“ erkennen und gezielt, spontan und angemessen im mündlichen Sprachgebrauch anwenden. DE.6.5.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Leseverstehen zu Texten über Geschäfte und Orte in der Stadt sowie zu einfachen Wegbeschreibungen vorbereiten. DE.6.5.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können gezielt Informationen aus kurzen Texten, Stadtplänen und Schildern erfassen und deren Bedeutung im Kontext von „Meine Umgebung“ erschließen. DE.6.5.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den thematischen Zielwortschatz zu „Meine Umgebung“ gezielt erkennen und in verschiedenen kommunikativen Kontexten mündlich und schriftlich korrekt und angemessen anwenden. DE.6.5.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen zur Orientierung in der Stadt und zur Wegbeschreibung erkennen und gezielt in mündlichen und schriftlichen Kommunikationssituationen anwenden. DE.6.5.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können kurze schriftliche Texte zu ihrer Umgebung in der Stadt verfassen und einfache Wegbeschreibungen klar und verständlich schriftlich darstellen. DE.6.5.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den mündlichen Ausdruck zum Thema Meine Umgebung vorbereiten. DE.6.5.SP3.3 – Inhalte für das Sprechen organisieren und anwenden Lernziel: Die Schüler können klar und verständlich über Wegbeschreibungen, Orte und Geschäfte in ihrer Umgebung sprechen und können passende Redemittel anwenden.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 50,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:6:DE.6.6.H1.1",
    "code": "DE.6.6.H1.1",
    "statement": "– Vorbereitung auf das Hör-und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Hör-/Sehverstehen zu den Themen „Die Tiere und ihre Eigenschaften“, „Die Haustiere“, „Die Bauernhoftiere“ und „Die Wildtiere“ vorbereiten, um vertraute Tiernamen, Eigenschaften, Geräusche und grundlegende Aussagen zu erkennen und zu deuten. DE.6.6.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen erkennen und verstehen. DE.6.6.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale phonetische Merkmale und Aussprachemuster zu den Themen bewusst erkennen und korrekt anwenden. Sie können Tiernamen und beschreibende Adjektive deutlich und altersgerecht aussprechen. DE.6.6.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Leseverstehen zu den Themen vorbereiten und können erste inhaltliche Vorhersagen treffen. DE.6.6.L2.3. –Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen gezielt Informationen und zentrale Aussagen zu Tieren und deren Eigenschaften erfassen. Sie können Bedeutungen aus dem Textzusammenhang erschließen und ihr Textverständnis reflektieren. DE.6.6.W2.1. – Zielwortschatz erkennen und anwenden Die Schüler können den Zielwortschatz zum Thema Tiere erkennen, verstehen und in einfachen mündlichen und schriftlichen Kommunikationssituationen situationsgerecht anwenden. DE.6.6.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen im Kontext der Themen erkennen und korrekt anwenden. DE.6.6.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können im Kontext der Themen eigene schriftliche Inhalte vorbereiten und verfassen. Die Schüler können die Tiere benennen, beschreiben und kurze inhaltlich sinnvolle Texte dazu schreiben. Sie gewinnen Sicherheit im schriftlichen Ausdruck und lernen, Wortschatz und Strukturen sinnvoll im Kontext einzusetzen. DE.6.6.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den Sprechprozess zum Thema „Die Tiere“ vorbereiten und können Redemittel sowie Satzstrukturen für Gespräche und kurze Präsentationen aktivieren. DE.6.6.SP3.3. –Inhalte für das Sprechen organisieren und anwenden Lernziel: Die Schüler können eigene Aussagen und Gesprächsbeiträge zum Thema Tiere vorbereiten und wenden zentrale Redemittel, Satzstrukturen und Wortschatz im freien und gelenkten Sprechen situationsgerecht an.",
    "grade": "6",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 59,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "6.Sınıf",
        "row": 67,
        "col": 6
      }
    ]
  }
]