[
  {
    "outcome_id": "EN:8:909a244f8e",
    "code": null,
    "statement": "Listening E8.1.L1. Students will be able to understand the specific information in short conversations on everyday topics, such as accepting and refusing an offer/invitation, apologizing and making simple inquiries. Spoken Interaction E8.1.SI1. Students will be able to interact with reasonable ease in structured situations and short conversations involving accepting and refusing an offer/invitation, apologizing and making simple inquiries. Spoken Production E8.1.SP1. Students will be able to structure a talk to make simple inquiries, give explanations and reasons. Reading E8.1.R1. Students will be able to understand short and simple texts about friendship. E8.1.R2. Students will be able to understand short and simple invitation letters, cards and e-mails. Writing E8.1.W1. Students will be able to write a short and simple letter apologizing and giving reasons for not attending a party in response to an invitation.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "1 Friendship",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 3,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:b283e6c87c",
    "code": null,
    "statement": "Listening E8.2.L1. Students will be able to understand phrases and expressions about regular activities of teenagers. Spoken Interaction E8.2.SI1. Students will be able to talk about regular activities of teenagers. Spoken Production E8.2.SP1. Students will be able to express what they prefer, like and dislike. E8.2.SP2. Students will be able to give a simple description of daily activities in a simple way. Reading E8.2.R1. Students will be able to understand short and simple texts about regular activities of teenagers. Writing E8.2.W1. Students will be able to write a short and simple paragraph about regular activities of teenagers.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "2 Teen Life",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 7,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:0a47fe318f",
    "code": null,
    "statement": "Listening E8.3.L1. Students will be able to get the gist of short, clear, simple descriptions of a process. Spoken Interaction E8.3.SI1. Students will be able to ask and answer questions and exchange ideas and information on a topic related to how something is processed. Spoken Production E8.3.SP1. Students will be able to give a simple description about a process. Reading E8.3.R1. Students will be able to understand the overall meaning of short texts about a process. E8.3.R2. Students will be able to guess the meaning of unknown words from the text. Writing E8.3.W1. Students will be able to write a series of simple phrases and sentences by using linkers to describe a process.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "3 In The Kitchen",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 10,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 14,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:1be08fd355",
    "code": null,
    "statement": "Listening E8.4.L1. Students will be able to understand phrases and related vocabulary items. E8.4.L2. Students will be able to follow a phone conversation. Spoken Interaction E8.4.SI1. Students will be able to make a simple phone call asking and responding to questions. Spoken Production E8.4.SP1. Students will be able to express their decisions taken at the moment of conversation. Reading E8.4.R1. Students will be able to understand short and simple texts with related vocabulary. Writing E8.4.W1. Students will be able to write short and simple conversations.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "4 On The Phone",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 16,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:e0fd75c326",
    "code": null,
    "statement": "Listening E8.5.L1. Students will be able to understand the gist of oral texts. E8.5.L2. Students will be able to comprehend phrases and related vocabulary items. Spoken Interaction E8.5.SI1. Students will be able to talk about their Internet habits. E8.5.SI2. Students will be able to exchange information about the Internet. Spoken Production E8.5.SP1. Students will be able to make excuses, and to accept and refuse offers by using a series of phrases and simple sentences. Reading E8.5.R1. Students will be able to identify main ideas in short and simple texts about internet habits. E8.5.R2. Students will be able to find specific information about the Internet in various texts. Writing E8.5.W1. Students will be able to write a basic paragraph to describe their internet habits.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "5 The Internet",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 22,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:4441e95be9",
    "code": null,
    "statement": "Listening E8.6.L1. Students will be able to follow a discussion on adventures. E8.6.L2. Students will be able to understand the main points of simple messages. Spoken Interaction E8.6.SI1. Students will be able to interact with reasonable ease in short conversations. E8.6.SI2. Students will be able to talk about comparisons, preferences and their reasons. Spoken Production E8.6.SP1. Students will be able to make comparisons about sports and games by using simple descriptive language. Reading E8.6.R1. Students will be able to understand short and simple texts to find the main points about adventures. Writing E8.6.W1. Students will be able to write a short and simple paragraph comparing two objects.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "6 Adventures",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 27,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:7f4a785548",
    "code": null,
    "statement": "Listening E8.7.L1. Students will be able to understand and extract the specific information from short and simple oral texts. Spoken Interaction E8.7.SI1. Students will be able to exchange information about tourism. E8.7.SI2. Students will be able to talk about their favorite tourist attractions by giving details. Spoken Production E8.7.SP1. Students will be able to express their preferences for particular tourist attractions and give reasons. E8.7.SP2. Students will be able to make simple comparisons between different tourist attractions. E8.7.SP3. Students will be able to express their experiences about places. Reading E8.7.R1. Students will be able to find specific information from various texts about tourism. Writing E8.7.W1. Students will be able to design a brochure, advertisement or a postcard about their favorite tourist attraction(s).",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "7 Tourism",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 30,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:e5129f6a56",
    "code": null,
    "statement": "Listening E8.8.L1. Students will be able to identify the main points of a short talk describing the responsibilities of people. E8.8.L2. Students will be able to understand obligations, likes and dislikes in various oral texts. E8.8.L3. Students will be able to follow topic change during factual, short talks. Spoken Interaction E8.8.SI1. Students will be able to interact during simple, routine tasks requiring a direct exchange of information. E8.8.SI2. Students will be able to talk about responsibilities. Spoken Production E8.8.SP1. Students will be able to express their obligations, likes and dislikes in simple terms. Reading E8.8.R1. Students will be able to understand various short and simple texts about responsibilities. Writing E8.8.W1. Students will be able to write short and simple poems/stories about their feelings and responsibilities.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "8 Chores",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 35,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:c72f94a8f0",
    "code": null,
    "statement": "Listening E8.9.L1. Students will be able to recognize main ideas and key information in short oral texts about science. Spoken Interaction E8.9.SI1. Students will be able to talk about actions happening currently and in the past. E8.9.SI2. Students will be able to involve in simple discussions about scientific achievements. Spoken Production E8.9.SP1. Students will be able to describe actions happening currently. E8.9.SP2. Students will be able to present information about scientific achievements in a simple way. Reading E8.9.R1. Students will be able to understand short and simple texts about actions happening currently and in the past. E8.9.R2. Students will be able to identify main ideas and supporting details in short texts about science. Writing E8.9.W1. Students will be able to write simple descriptions of scientific achievements in a short paragraph.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "9 Science",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 40,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:8:74c8ba5695",
    "code": null,
    "statement": "Listening E8.10.L1. Students will be able to identify the main points of TV news about natural forces and disasters. Spoken Interaction E8.10.SI1. Students will be able to talk about predictions concerning future of the Earth. E8.10.SI2. Students will be able to negotiate reasons and results to support their predictions about natural forces and disasters. Spoken Production E8.10.SP1. Students will be able to express predictions concerning future of the Earth. E8.10.SP2. Students will be able to give reasons and results to support their predictions about natural forces and disasters. Reading E8.10.R1. Students will be able to identify specific information in simple texts about natural forces and disasters. Writing E8.10.W1. Students will be able to write a short and simple paragraph about reasons and results of natural forces and disasters.",
    "grade": "8",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "10 Natural Forces",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 44,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "8.Sınıf",
        "row": 46,
        "col": 6
      }
    ]
  }
]