[
  {
    "outcome_id": "EN:7:7486303d23",
    "code": null,
    "statement": "Listening E7.1.L1. Students will be able to understand clear, standard speech on appearances and personalities. Spoken Interaction E7.1.SI1. Students will be able to talk about other people’s appearances and personalities. Spoken Production E7.1.SP1. Students will be able to report on apperances and personalities of other people. Reading E7.1.R1. Students will be able to understand a simple text about appearances, personalities, and comparisons including explanations and reasons. Writing E7.1.W1. Students will be able to write simple pieces to compare people.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "1 Appearance And Personality",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 3,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:1ad845274e",
    "code": null,
    "statement": "Listening E7.2.L1. Students will be able to recognize frequency adverbs in simple oral texts. Spoken Interaction E7.2.SI1. Students will be able to ask questions related to the frequency of events. Spoken Production E7.2.SP1. Students will be able to talk about routines/daily activities by using frequency adverbs and giving explanations and reasons. Reading E7.2.R1. Students will be able to understand short and simple texts on sports. Writing E7.2.W1. Students will be able to write pieces about routines/daily activities by using frequency adverbs.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "2 Sports",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 7,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:95e857d2ee",
    "code": null,
    "statement": "Listening E7.3.L1. Students will be able to recognize specific information in oral texts dealing with past events and dates. Spoken Interaction E7.3.SI1. Students will be able to talk about past events with definite time. Spoken Production E7.3.SP1. Students will be able to describe past events and experiences. Reading E7.3.R1. Students will be able to spot specific information about names and dates in past events in written texts. Writing E7.3.W1. Students will be able to write a short and simple report about past events.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "3 Biographies",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 10,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 14,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:44d1c85908",
    "code": null,
    "statement": "Listening E7.4.L1. Students will be able to understand past and present events in oral texts. E7.4.L2. Students will be able to identify the names of wild animals in simple oral texts. Spoken Interaction E7.4.SI1. Students will be able to ask people questions about characteristics of wild animals. Spoken Production E7.4.SP1. Students will be able to make simple suggestions. E7.4.SP2. Students will be able to report on past and present events. Reading E7.4.R1. Students will be able to understand past and present events in simple texts including explanations and reasons. E7.4.R2. Students will be able to spot the names of wild animals in simple texts. Writing E7.4.W1. Students will be able to write pieces describing wildlife.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "4 Wild Animals",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 16,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:3b09cc950a",
    "code": null,
    "statement": "Listening E7.5.L1. Students will be able to understand simple oral texts about daily routines and preferences. Spoken Interaction E7.5.SI1. Students will be able to ask questions about preferences of other people. E7.5.SI2. Students will be able to talk about past events and personal experiences. Spoken Production E7.5.SP1. Students will be able to state their preferences. E7.5.SP2. Students will be able to describe past events in a simple way. Reading E7.5.R1. Students will be able to understand simple texts about daily routines and preferences. E7.5.R2. Students will be able to understand simple texts about past events. Writing E7.5.W1. Students will be able to write pieces about daily routines and preferences.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "5 Television",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 22,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:9f09bec89e",
    "code": null,
    "statement": "Listening E7.6.L1. Students will be able to recognize utterances related to suggestions, needs and quantity of things. Spoken Interaction E7.6.SI1. Students will be able to talk about arrangements and sequences of actions. Spoken Production E7.6.SP1. Students will be able to make suggestions. E7.6.SP2. Students will be able to express needs and quantity. Reading E7.6.R1. Students will be able to understand texts about celebrations. Writing E7.6.W1. Students will be able to write invitation cards.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "6 Celebrations",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 27,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:9b263004e4",
    "code": null,
    "statement": "Listening E7.7.L1. Students will be able to understand utterances about predictions and future events in simple oral texts. Spoken Interaction E7.7.SI1. Students will be able to talk about simple predictions. Spoken Production E7.7.SP1. Students will be able to report on simple predictions. Reading E7.7.R1. Students will be able to understand short and simple texts about predictions. Writing E7.7.W1. Students will be able to write pieces about predictions and future events.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "7 Dreams",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 30,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:c7e2697fd2",
    "code": null,
    "statement": "Listening E7.8.L1. Students will be able to recognize the names of the public buildings. E7.8.L2. Students will be able to understand explanations with reasons. Spoken Interaction E7.8.SI1. Students will be able to give explanations with reasons. Spoken Production E7.8.SP1. Students will be able to report on explanations with reasons. Reading E7.8.R1. Students will be able to understand simple expressions and recognize familiar words about explanations with reasons. Writing E7.8.W1. Students will be able to write pieces about explanations with reasons.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "8 Public Buildings",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 35,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:014f6e3a5b",
    "code": null,
    "statement": "Listening E7.9.L1. Students will be able to understand phrases and the highest frequency vocabulary about environment. E7.9.L2. Students will be able to follow how a simple process is described in clear oral texts. Spoken Interaction E7.9.SI1. Students will be able to talk about obligations. E7.9.SI2. Students will be able to give simple instructions for a specific process. Spoken Production E7.9.SP1. Students will be able to give a simple description or presentation of a process. Reading E7.9.R1. Students will be able to identify specific information in various texts about environment. Writing E7.9.W1. Students will be able to write short, simple messages about environment. E7.9.W2. Students will be able to write short description of a process.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "9 Environment",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 40,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:c04846b980",
    "code": null,
    "statement": "Listening E7.10.L1. Students will be able to identify the discussion topic about popular science in simple oral texts. Spoken Interaction E7.10.SI1. Students will be able to make simple comparisons. E7.10.SI2. Students will be able to talk about past events. Spoken Production E7.10.SP1. Students will be able to report on general truths in various ways. Reading E7.10.R1. Students will be able to identify specific information in various texts about facts and general truths. E7.10.R2. Students will be able to identify specific information about past events. Writing E7.10.W1. Students will be able to write short and basic descriptions of facts and general truths.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": "10 Planets",
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 44,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE 6, 7 ve 8. SINIF 2025-2026 YILLIK PLANLAR (ESKİ PROGRAM).xlsx",
        "sheet": "7.Sınıf",
        "row": 46,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.6.1.L1",
    "code": "ENG.6.1.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” carefully. ENG.6.1.L2. Students can bring information about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” together through significant details and main components while listening (to)/ watching it. ENG.6.1.L3. Students can make meaning of/derive meaning from the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” through significant details by listening (to)/watching it carefully. ENG.6.1.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.P1. Students can select and use the target phonological elements of the current content about “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.6.1.R1. Students can get ready for the reading-comprehension process about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.R2. Students can bring information about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.6.1.R3. Students can make meaning of / derive meaning from the current content about “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” by reading it carefully. ENG.6.1.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.6.1.V1. Students can select and use the target vocabulary of the current content about “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.6.1.G1. Students can select and use the target grammatical elements of the current content about “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.6.1.W1. Students can get ready for the writing-expression process about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.W2. Students can understand the model/example for the writing task about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.W3. Students can organise a content for the assigned writing task on the current content “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” based on the model/example provided. ENG.6.1.W4. Students can individually construct/form content for the assigned writing task on the current content “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” to communicate with other people. ENG.6.1.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.6.1.S1. Students can get ready for speaking-expression process about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.S2. Students can use the model/example for producing verbal content about the current content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations”. ENG.6.1.S3. Students can organise a new verbal content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” by speaking accurately, efficiently, and authentically. ENG.6.1.S4. Students can construct a new verbal content on “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” by speaking accurately, efficiently, and authentically. ENG.6.1.S5. Students can reorganise (reconstruct) and use information about the “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” to communicate with other people. ENG.6.1.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “school life and education with school rules; people, roles, and responsibilities at school; school routines; national days and celebrations” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 5,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.1.L1",
    "code": "ENG.7.1.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.L2. Students can bring together the information in the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.L3. Students can make sense of and derive meaning from the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.7.1.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.1.R1. Students can prepare for reading the content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” efficiently and effectively. ENG.7.1.R2. Students can bring information together about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” through skimming, scanning and detailed reading. ENG.7.1.R3. Students can make sense of and derive meaning from the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.7.1.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.1.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.1.W1. Students can prepare for writing efficiently and accurately based on the current content about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.W3. Students can construct new written content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” based on their understanding of the model(s) provided. ENG.7.1.W4. Students can practise producing written content based on the current theme “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.W5. Students can engage in the process of writing related to the content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.W6. Students can reconstruct their writing about the current theme on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” to communicate effectively about it. ENG.7.1.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 8,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.1.S1",
    "code": "ENG.7.1.S1",
    "statement": "Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.S2. Students can analyse and understand the model content related to “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” to support the production of spoken language. ENG.7.1.S3. Students can produce meaningful and accurate spoken content related to the current theme on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations”. ENG.7.1.S4. Students can construct meaningful spoken content about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” through efficient and meaningful practice. ENG.7.1.S5. Students can reconstruct the information about “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” when communicating with others. ENG.7.1.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “school life and education with educational activities, competitions, and celebrations at school; school trips; national days and celebrations” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 12,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.2.L1",
    "code": "ENG.7.2.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.L2. Students can bring together the information in the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.L3. Students can make sense of and derive meaning from the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” in relation to themselves or others, both individually and/or with others. ENG.7.2.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” to develop holistic and conscious pronunciation skills after recognising them in context.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 14,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.2.R1",
    "code": "ENG.7.2.R1",
    "statement": "Students can prepare for reading the content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” efficiently and effectively. ENG.7.2.R2. Students can bring information together about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” through skimming, scanning and detailed reading. ENG.7.2.R3. Students can make sense of and derive meaning from the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” in relation to themselves or others, both individually and/or with others. ENG.7.2.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.2.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.2.W1. Students can prepare for writing efficiently and accurately based on the current content about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.W3. Students can construct new written content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” based on their understanding of the model(s) provided. ENG.7.2.W4. Students can practise producing written content based on the current theme “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.W5. Students can engage in the process of writing related to the content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.W6. Students can reconstruct their writing about the current theme on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” to communicate effectively about it. ENG.7.2.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” in relation to themselves or others, both individually and/or with others. ENG.7.2.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.S2. Students can analyse and understand the model content related to “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” to support the production of spoken language. ENG.7.2.S3. Students can produce meaningful and accurate spoken content related to the current theme on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning”. ENG.7.2.S4. Students can construct meaningful spoken content about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” through efficient and meaningful practice. ENG.7.2.S5. Students can reconstruct the information about “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” when communicating with others. ENG.7.2.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “classroom life and learning with learning difficulties and problems for teenagers, healthy classroom atmosphere for peaceful learning” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 17,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.3.L1",
    "code": "ENG.7.3.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.L2. Students can bring together the information in the current content on “personal life and well- being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.L3. Students can make sense of and derive meaning from the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “personal life and well- being with advantages and disadvantages of social media; staying healthy and fit” in relation to themselves or others, both individually and/or with others. ENG.7.3.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.3.R1. Students can prepare for reading the content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” efficiently and effectively. ENG.7.3.R2. Students can bring information together about the current content on “personal life and well- being with advantages and disadvantages of social media; staying healthy and fit” through skimming, scanning, and detailed reading. ENG.7.3.R3. Students can make sense of and derive meaning from the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” in relation to themselves or others, both individually and/or with others. ENG.7.3.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.3.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately based on the current content about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness- raising and discovery. ENG.7.3.W1. Students can prepare for writing efficiently and accurately based on the current content about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.W3. Students can construct new written content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” based on their understanding of the model(s) provided. ENG.7.3.W4. Students can practise producing written content based on the current theme “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.W5. Students can engage in the process of writing related to the content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.W6. Students can reconstruct their writing about the current theme on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” to communicate effectively about it. ENG.7.3.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 20,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.3.S1",
    "code": "ENG.7.3.S1",
    "statement": "Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.S2. Students can analyse and understand the model content related to “personal life and well- being with advantages and disadvantages of social media; staying healthy and fit” to support the production of spoken language. ENG.7.3.S3. Students can produce meaningful and accurate spoken content related to the current theme on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit”. ENG.7.3.S4. Students can construct meaningful spoken content about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” through efficient and meaningful practice. ENG.7.3.S5. Students can reconstruct the information about “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” when communicating with others. ENG.7.3.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “personal life and well-being with advantages and disadvantages of social media; staying healthy and fit” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 24,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.4.L1",
    "code": "ENG.7.4.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.L2. Students can bring together the information in the current content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.L3. Students can make sense of and derive meaning from the current content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “family life and home with future houses; family members’ plans (for the future)” in relation to themselves or others, both individually and/or with others. ENG.7.4.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “family life and home with future houses; family members’ plans (for the future)” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.4.R1. Students can prepare for reading the content on “family life and home with future houses; family members’ plans (for the future)” efficiently and effectively. ENG.7.4.R2. Students can bring information together about the current content on “family life and home with future houses; family members’ plans (for the future)” through skimming, scanning, and detailed reading. ENG.7.4.R3. Students can make sense of and derive meaning from the current content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “family life and home with future houses; family members’ plans (for the future)” in relation to themselves or others, both individually and/or with others. ENG.7.4.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “family life and home with future houses; family members’ plans (for the future)” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.4.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “family life and home with future houses; family members’ plans (for the future)”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 25,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.4.W1",
    "code": "ENG.7.4.W1",
    "statement": "Students can prepare for writing efficiently and accurately based on the current content about “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.W3. Students can construct new written content on “family life and home with future houses; family members’ plans (for the future)” based on their understanding of the model(s) provided. ENG.7.4.W4. Students can practise producing written content based on the current theme “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.W5. Students can engage in the process of writing related to the content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.W6. Students can reconstruct their writing about the current theme on “family life and home with future houses; family members’ plans (for the future)” to communicate effectively about it. ENG.7.4.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “family life and home with future houses; family members’ plans (for the future)” in relation to themselves or others, both individually and/or with others. ENG.7.4.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.S2. Students can analyse and understand the model content related to “family life and home with future houses; family members’ plans (for the future)” to support the production of spoken language. ENG.7.4.S3. Students can produce meaningful and accurate spoken content related to the current theme on “family life and home with future houses; family members’ plans (for the future)”. ENG.7.4.S4. Students can construct meaningful spoken content about “family life and home with future houses; family members’ plans (for the future)” through efficient and meaningful practice. ENG.7.4.S5. Students can reconstruct the information about “family life and home with future houses; family members’ plans (for the future)” when communicating with others. ENG.7.4.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “family life and home with future houses; family members’ plans (for the future)” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 28,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.5.L1",
    "code": "ENG.7.5.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.L2. Students can bring together the information in the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.L3. Students can make sense of and derive meaning from the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” in relation to themselves or others, both individually and/ or with others. ENG.7.5.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.5.R1. Students can prepare for reading the content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” efficiently and effectively. ENG.7.5.R2. Students can bring information together about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” through skimming, scanning and detailed reading. ENG.7.5.R3. Students can make sense of and derive meaning from the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” in relation to themselves or others, both individually and/or with others. ENG.7.5.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.5.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.5.W1. Students can prepare for writing efficiently and accurately based on the current content about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.W3. Students can construct new written content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” based on their understanding of the model(s) provided. ENG.7.5.W4. Students can practise producing written content based on the current theme “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.W5. Students can engage in the process of writing related to the content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.W6. Students can reconstruct their writing about the current theme on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” to communicate effectively about it. ENG.7.5.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” in relation to themselves or others, both individually and/or with others. ENG.7.5.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.S2. Students can analyse and understand the model content related to “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” to support the production of spoken language. ENG.7.5.S3. Students can produce meaningful and accurate spoken content related to the current theme on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas”. ENG.7.5.S4. Students can construct meaningful spoken content about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” through efficient and meaningful practice. ENG.7.5.S5.Students can reconstruct the information about “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” when communicating with others. ENG.7.5.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “life in the neighbourhood and city including social life with helping people in need in the neighbourhood and the city; technology in cities and rural areas” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 30,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.6.L1",
    "code": "ENG.7.6.L1",
    "statement": "Students can prepare and get ready for listening to/watching about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.L2. Students can bring together the information in the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.L3. Students can make sense of and derive meaning from the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening to)/watching process about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” in relation to themselves or others, both individually and/or with others. ENG.7.6.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.6.R1. Students can prepare for reading the content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” efficiently and effectively. ENG.7.6.R2. Students can bring information together about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” through skimming, scanning and detailed reading. ENG.7.6.R3. Students can make sense of and derive meaning from the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” in relation to themselves or others, both individually and/or with others. ENG.7.6.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.6.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.6.W1. Students can prepare for writing efficiently and accurately based on the current content about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.W3. Students can construct new written content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” based on their understanding of the model(s) provided. ENG.7.6.W4. Students can practise producing written content based on the current theme “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.W5. Students can engage in the process of writing related to the content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.W6. Students can reconstruct their writing about the current theme on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” to communicate effectively about it. ENG.7.6.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” in relation to themselves or others, both individually and/or with others ENG.7.6.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.S2. Students can analyse and understand the model content related to “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” to support the production of spoken language. ENG.7.6.S3. Students can produce meaningful and accurate spoken content related to the current theme on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events”. ENG.7.6.S4. Students can construct meaningful spoken content about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” through efficient and meaningful practice. ENG.7.6.S5. Students can reconstruct the information about “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” when communicating with others. ENG.7.6.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “life in the world and culture with healthy food and unhealthy food in the world (ecological food) and international events” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 40,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.7.L1",
    "code": "ENG.7.7.L1",
    "statement": "Students can prepare and get ready for listening (to watching about the current content on “life in nature and global problems”. ENG.7.7.L2. Students can bring together the information in the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.L3. Students can make sense of and derive meaning from the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” in relation to themselves or others, both individually and/or with others. ENG.7.7.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.7.R1. Students can prepare for reading the content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” efficiently and effectively. ENG.7.7.R2. Students can bring information together about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” through skimming, scanning and detailed reading. ENG.7.7.R3. Students can make sense of and derive meaning from the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” in relation to themselves or others, both individually and/or with others. ENG.7.7.V1. Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.7.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.7.W1. Students can prepare for writing efficiently and accurately based on the current content about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.W3. Students can construct new written content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” based on their understanding of the model(s) provided. ENG.7.7.W4. Students can practise producing written content based on the current theme “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.W5. Students can engage in the process of writing related to the content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.W6. Students can reconstruct their writing about the current theme on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” to communicate effectively about it. ENG.7.7.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” in relation to themselves or others, both individually and/or with others. ENG.7.7.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.S2. Students can analyse and understand the model content related to “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” to support the production of spoken language. ENG.7.7.S3. Students can produce meaningful and accurate spoken content related to the current theme on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature”. ENG.7.7.S4. Students can construct meaningful spoken content about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” through efficient and meaningful practice. ENG.7.7.S5. Students can reconstruct the information about “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” when communicating with others. ENG.7.7.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “life in nature and global problems with influence of technology on global issues (health); influence of technology on problems and solutions about nature” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 44,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.8.L1",
    "code": "ENG.7.8.L1",
    "statement": "Students can prepare and get ready for listening (to)/watching about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.L2. Students can bring together the information in the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.L3. Students can make sense of and derive meaning from the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.L4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the listening (to)/watching process about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” in relation to themselves or others, both individually and/or with others. ENG.7.8.P1. Students can select and use target phonological aspects such as pronunciation and intonation of target sounds, words, phrases, clauses, and sentences in utterances authentically, naturally, and accurately in the current content about “life in the universe and future with time travel; future technologies and their use (robots, robotics)” to develop holistic and conscious pronunciation skills after recognising them in context. ENG.7.8.R1. Students can prepare for reading the content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” efficiently and effectively. ENG.7.8.R2. Students can bring information together about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” through skimming, scanning and detailed reading. ENG.7.8.R3. Students can make sense of and derive meaning from the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.R4. Students can reflect on the information, experiences, thoughts, ideas, and feelings related to the reading process about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 49,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:7:ENG.7.8.V1",
    "code": "ENG.7.8.V1",
    "statement": "Students can select and use target vocabulary efficiently, effectively, and accurately, based on the current content about “life in the universe and future with time travel; future technologies and their use (robots, robotics)” after recognising them in context and developing their conscious and inductive vocabulary learning skills. ENG.7.8.G1. Students can select and use target grammatical language items efficiently, effectively, and accurately, based on the current content about “life in the universe and future with time travel; future technologies and their use (robots, robotics)”, after recognising them in context and developing their conscious and inductive grammaring skills through consciousness-raising and discovery. ENG.7.8.W1. Students can prepare for writing efficiently and accurately based on the current content about “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.W2. Students can analyse and understand a provided model to guide them in producing similar writing tasks related to the content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.W3. Students can construct new written content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” based on their understanding of the model(s) provided. ENG.7.8.W4. Students can practise producing written content based on the current theme “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.W5. Students can engage in the process of writing related to the content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.W6. Students can reconstruct their writing about the current theme on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” to communicate effectively about it. ENG.7.8.W7. Students can reflect on their experiences, thoughts, ideas, and feelings related to the writing process about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” in relation to themselves or others, both individually and/or with others. ENG.7.8.S1. Students can prepare themselves to speak meaningfully, fluently, and efficiently about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.S2. Students can analyse and understand the model content related to “life in the universe and future with time travel; future technologies and their use (robots, robotics)” to support the production of spoken language. ENG.7.8.S3. Students can produce meaningful and accurate spoken content related to the current theme on “life in the universe and future with time travel; future technologies and their use (robots, robotics)”. ENG.7.8.S4. Students can construct meaningful spoken content about “life in the universe and future with time travel; future technologies and their use (robots, robotics)” through efficient and meaningful practice. ENG.7.8.S5. Students can reconstruct the information about “life in the universe and future with time travel; future technologies and their use (robots, robotics)” when communicating with others. ENG.7.8.S6. Students can reflect on their experiences, thoughts, ideas, and feelings related to the speaking process about the current content on “life in the universe and future with time travel; future technologies and their use (robots, robotics)” in relation to themselves or others, both individually and/or with others.",
    "grade": "7",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 7",
        "row": 52,
        "col": 6
      }
    ]
  }
]