[
  {
    "outcome_id": "EN:5:ENG.4.1.L1",
    "code": "ENG.4.1.L1",
    "statement": "Pupils can get ready for the listening/watching-comprehension process for the current content on “school life with people at school; daily routines and activities at school; activities at present, favourite activities; favourite months; national days and celebrations”. ENG.4.1.W1. Pupils can get ready for the writing-expression process about the current content on “school life with people at school; daily routines and activities at school; activities at present, favourite activities; favourite months; national days and celebrations” in an age- and level-appropriate way. ENG.4.1.R1. Pupils can get ready for the reading-comprehension process about the current content on “school life with people at school; daily routines and activities at school; activities at present, favourite activities; favourite months; national days and celebrations”. ENG.4.1.V1. Pupils can select and use the target vocabulary of the current content about “school life with people at school; daily routines and activities at school; activities at present, favourite activities; favourite months; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.1.G1. Pupils can select and use the language including target grammatical elements of the current content about “school life with people at school; daily routines and activities at school; activities at present, favourite activities; favourite months; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.2.R1. Pupils can get ready for the reading-comprehension process about the current content on “classroom life with school subjects and classroom activities; favourite school subjects and classroom activities now and in the past; time, seasons of the year, favourite seasons”. ENG.4.2.V1. Pupils can select and use the target vocabulary of the current content about “classroom life with school subjects and classroom activities; favourite school subjects and classroom activities now and in the past; time, seasons of the year, favourite seasons” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.2.W1. Pupils can get ready for the writing-expression process about the current content on “classroom life with school subjects and classroom activities; favourite school subjects and classroom activities now and in the past; time, seasons of the year, favourite seasons” in an age- and level appropriate way. ENG.4.3.R1. Pupils can get ready for the reading-comprehension process about the current content on “personal life with physical appearances and personality; clothing and clothing preferences; hobbies and abilities now and in the past; weather; comparisons”. ENG.4.3.V1. Pupils can select and use the target vocabulary of the current content about “personal life with physical appearances and personality; clothing and clothing preferences; hobbies and abilities now and in the past; weather; comparisons” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.3.G1. Pupils can select and use the language including target grammatical elements of the current content about “personal life with physical appearances and personality; clothing and clothing preferences; hobbies and abilities now and in the past; weather; comparisons” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.3.S1. Pupils can get ready for the speaking-expression process about the current content on “personal life with physical appearances and personality; clothing and clothing preferences; hobbies and abilities now and in the past; weather; comparisons” with the help of supplementary audio-visual materials. ENG.4.4.L1. Pupils can get ready for the listening/watching-comprehension process for the current content on “family life and life in the neighbourhood with family members’ jobs; family members’ long-lasting habits; family members’ errands; places for services in the neighbourhood; comparisons”. ENG.4.4.R1. Pupils can get ready for the reading-comprehension process about the current content on “family life and life in the neighbourhood with family members’ jobs; family members’ long-lasting habits; family members’ errands; places for services in the neighbourhood; comparisons”. ENG.4.4.V1. Pupils can select and use the target vocabulary of the current content about “family life and life in the neighbourhood with family members’ jobs; family members’ long-lasting habits; family members’ errands; places for services in the neighbourhood; comparisons” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.4.S1. Pupils can get ready for speaking-expression process about the current content on “family life and life in the neighbourhood with family members’ jobs; family members’ long-lasting habits; family members’ errands; places for services in the neighbourhood; comparisons” with the help of supplementary audio-visual materials. ENG.4.5.R1. Pupils can get ready for the reading-comprehension process about the current content on “homes, houses and the neighbourhood with life on the seaside; sea/marine animals and their habitats: activities of sea/marine animals: dangers for sea/marine animals; types of housesby the water”. ENG.4.5.W1. Pupils can get ready for the writing-expression process about the current content on “homes, houses and the neighbourhood with life on the seaside; sea/marine animals and their habitats: activities of sea/marine animals: dangers for sea/marine animals; types of houses by the water” in an age- and level-appropriate way. ENG.4.6.R1. Pupils can get ready for the reading-comprehension process about the current content on “life in the city and the world with healthy and unhealthy food; national and international dishes; countries; holidays”. ENG.4.6.V1. Pupils can select and use the target vocabulary of the current content about “life in the city and the world with healthy and unhealthy food; national and international dishes; countries; holidays” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.4.6.W1. Pupils can get ready for the writing-expression process about the current content on “life in the city and the world with healthy and unhealthy food; national and international dishes; countries; holidays” in an age- and level-appropriate way.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 5,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 6,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.1.L1",
    "code": "ENG.5.1.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “school life with people, places, and rules at school; school clubs; countries; national days and celebrations” carefully. ENG.5.1.L2. Students can bring information about the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations” together through significant details and main components while listening/watching it. ENG.5.1.L3. Students can make meaning of/derive meaning from the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations” through significant details by listening/watching it carefully. ENG.5.1.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.P1. Students can select and use the target phonological elements of the current content about “school life with people, places and rules at school; school clubs; countries; national days and celebrations” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.1.R1. Students can get ready for the reading-comprehension process about the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.R2. Students can bring information about the current content on “school life with people, places, and rules at school; school clubs; countries; national days and celebrations” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.1.R3. Students can make meaning of / derive meaning from the current content about “school life with people, places, and rules at school; school clubs; countries; national days and celebrations” by reading it carefully. ENG.5.1.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “school life with people, places and rules at school; school clubs; countries; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.5.1.V1. Students can select and use the target vocabulary of the current content about “school life with people, places, and rules at school; school clubs; countries; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.1.G1. Students can select and use the target grammatical elements of the current content about “school life with people, places and rules at school; school clubs; countries; national days and celebrations” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.1.W1. Students can get ready for the writing-expression process about the current content on “school life with people, places, and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.W2. Students can understand the model/example for the writing task about the current content on “school life with people, places, and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.W3. Students can organize a content for the assigned writing task on the current content “school life with people, places and rules at school; school clubs; countries; national days and celebrations” based on the model/example provided. ENG.5.1.W4. Students can individually construct/form content for the assigned writing task on the current content “school life with people, places, and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “school life with people, places and rules at school; school clubs; countries; national days and celebrations” to communicate with other people. ENG.5.1.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “school life with people, places and rules at school; school clubs; countries; national days and celebrations” in relation to themselves or others, both individually and/or with others. ENG.5.1.S1. Students can get ready for speaking-expression process about the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.S2. Students can use the model/example for producing verbal content about the current content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations”. ENG.5.1.S3. Students can organize a new verbal content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations” by speaking accurately, efficiently, and authentically. ENG.5.1.S4. Students can construct a new verbal content on “school life with people, places and rules at school; school clubs; countries; national days and celebrations” by speaking accurately, efficiently, and authentically. ENG.5.1.S5. Students can reorganize (reconstruct) and use information about the “school life with people, places and rules at school; school clubs; countries; national days and celebrations” to communicate with other people. ENG.5.1.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “school life with people, places and rules at school; school clubs; countries; national days and celebrations” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 6,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 10,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 12,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.2.L1",
    "code": "ENG.5.2.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” carefully. ENG.5.2.L2. Students can bring information about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” together through significant details and main components while listening/watching it. ENG.5.2.L3. Students can make meaning of/derive meaning from the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” through significant details by listening/watching it carefully. ENG.5.2.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.P1. Students can select and use the target phonological elements of the current content about “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.2.R1. Students can get ready for the reading-comprehension process about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.R2. Students can bring information about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.2.R3. Students can make meaning of / derive meaning from the current content about “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” by reading it carefully. ENG.5.2.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” in relation to themselves or others, both individually and/or with others. ENG.5.2.V1. Students can select and use the target vocabulary of the current content about “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.2.G1. Students can select and use the target grammatical elements of the current content about “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.2.W1. Students can get ready for the writing-expression process about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.W2. Students can understand the model/example for the writing task about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.W3. Students can organize a content for the assigned writing task on the current content “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” based on the model/example provided. ENG.5.2.W4. Students can individually construct/form content for the assigned writing task on the current content “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” to communicate with other people. ENG.5.2.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” in relation to themselves or others, both individually and/or with others. ENG.5.2.S1. Students can get ready for speaking-expression process about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.S2. Students can use the model /example for producing verbal content about the current content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time”. ENG.5.2.S3. Students can organize a new verbal content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” by speaking accurately, efficiently, and authentically. ENG.5.2.S4. Students can construct a new verbal content on “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” by speaking accurately, efficiently, and authentically. ENG.5.2.S5. Students can reorganize (reconstruct) and use information about the “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” to communicate with other people. ENG.5.2.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “classroom life with classroom rules and language; school subjects; timetables; classroom objects; days of the week; time” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 11,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 16,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 14,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 17,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.3.L1",
    "code": "ENG.5.3.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities” carefully. ENG.5.3.L2. Students can bring information about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities” together through significant details and main components while listening/watching it. ENG.5.3.L3. Students can make meaning of/derive meaning from the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities” through significant details by listening/watching it carefully. ENG.5.3.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.P1. Students can select and use the target phonological elements of the current content about “personal life with basic body parts and physical features; clothes; daily routines and activities” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.3.R1. Students can get ready for the reading-comprehension process about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.R2. Students can bring information about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.3.R3. Students can make meaning of / derive meaning from the current content about “personal life with basic body parts and physical features; clothes; daily routines and activities” by reading it carefully. ENG.5.3.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “personal life with basic body parts and physical features; clothes; daily routines and activities” in relation to themselves or others, both individually and/or with others. ENG.5.3.V1. Students can select and use the target vocabulary of the current content about “personal life with basic body parts and physical features; clothes; daily routines and activities” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.3.G1. Students can select and use the target grammatical elements of the current content about “personal life with basic body parts and physical features; clothes; daily routines and activities” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.3.W1. Students can get ready for the writing-expression process about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.W2. Students can understand the model/example for the writing task about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.W3. Students can organize a content for the assigned writing task on the current content “personal life with basic body parts and physical features; clothes; daily routines and activities” based on the model/example provided. ENG.5.3.W4. Students can individually construct/form content for the assigned writing task on the current content “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “personal life with basic body parts and physical features; clothes; daily routines and activities” to communicate with other people. ENG.5.3.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “personal life with basic body parts and physical features; clothes; daily routines and activities” in relation to themselves or others, both individually and/or with others. ENG.5.3.S1. Students can get ready for speaking-expression process about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.S2. Students can use the model/example for producing verbal content about the current content on “personal life with basic body parts and physical features; clothes; daily routines and activities”. ENG.5.3.S3. Students can organize a new verbal content on “personal life with basic body parts and physical features; clothes; daily routines and activities” by speaking accurately, efficiently, and authentically. ENG.5.3.S4. Students can construct a new verbal content on “personal life with basic body parts and physical features; clothes; daily routines and activities” by speaking accurately, efficiently, and authentically. ENG.5.3.S5. Students can reorganize (reconstruct) and use information about the “personal life with basic body parts and physical features; clothes; daily routines and activities” to communicate with other people. ENG.5.3.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “personal life with basic body parts and physical features; clothes; daily routines and activities” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 17,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 18,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 19,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.4.L1",
    "code": "ENG.5.4.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “family life with family members’ routines; family members’ hobbies and activities” carefully. ENG.5.4.L2. Students can bring information about the current content on “family life with family members’ routines; family members’ hobbies and activities” together through significant details and main components while listening/watching it. ENG.5.4.L3. Students can make meaning of/derive meaning from the current content on “family life with family members’ routines; family members’ hobbies and activities” through significant details by listening/watching it carefully. ENG.5.4.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.P1. Students can select and use the target phonological elements of the current content about “family life with family members’ routines; family members’ hobbies and activities” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.4.R1. Students can get ready for the writing-comprehension process about the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.R2. Students can bring information about the current content on “family life with family members’ routines; family members’ hobbies and activities” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.4.R3. Students can make meaning of / derive meaning from the current content about “family life with family members’ routines; family members’ hobbies and activities” by reading it carefully. ENG.5.4.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “family life with family members’ routines; family members’ hobbies and activities” in relation to themselves or others, both individually and/or with others. ENG.5.4.V1. Students can select and use the target vocabulary of the current content about “family life with family members’ routines; family members’ hobbies and activities” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.4.G1. Students can select and use the target grammatical elements of the current content about “family life with family members’ routines; family members’ hobbies and activities” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.4.W1. Students can get ready for the writing-expression process about the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.W2. Students can understand the model/example for the writing task about the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.W3. Students can organize a content for the assigned writing task on the current content “family life with family members’ routines; family members’ hobbies and activities” based on the model/example provided. ENG.5.4.W4. Students can individually construct/form content for the assigned writing task on the current content “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “family life with family members’ routines; family members’ hobbies and activities” to communicate with other people. ENG.5.4.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “family life with family members’ routines; family members’ hobbies and activities” in relation to themselves or others, both individually and/or with others. ENG.5.4.S1. Students can get ready for speaking-expression process about the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.S2. Students can use the model/example for producing verbal content about the current content on “family life with family members’ routines; family members’ hobbies and activities”. ENG.5.4.S3. Students can organize a new verbal content on “family life with family members’ routines; family members’ hobbies and activities” by speaking accurately, efficiently, and authentically. ENG.5.4.S4. Students can construct a new verbal content on “family life with family members’ routines; family members’ hobbies and activities” by speaking accurately, efficiently, and authentically. ENG.5.4.S5. Students can reorganize (reconstruct) and use information about the “family life with family members’ routines; family members’ hobbies and activities” to communicate with other people. ENG.5.4.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “family life with family members’ routines; family members’ hobbies and activities” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 22,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 20,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.5.L1",
    "code": "ENG.5.5.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” carefully. ENG.5.5.L2. Students can bring information about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” together through significant details and main components while listening/watching it. ENG.5.5.L3. Students can make meaning of/derive meaning from the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” through significant details by listening/watching it carefully. ENG.5.5.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.P1. Students can select and use the target phonological elements of the current content about “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.5.R1. Students can get ready for the reading-comprehension process about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.R2. Students can bring information about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.5.R3. Students can make meaning of / derive meaning from the current content about “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” by reading it carefully. ENG.5.5.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” in relation to themselves or others, both individually and/or with others. ENG.5.5.V1. Students can select and use the target vocabulary of the current content about “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.5.G1. Students can select and use the target grammatical elements of the current content about “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.5.W1. Students can get ready for the writing-expression process about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.W2. Students can understand the model/example for the writing task about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.W3. Students can organize a content for the assigned writing task on the current content “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” based on the model/example provided. ENG.5.5.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” to communicate with other people. ENG.5.5.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” in relation to themselves or others, both individually and/or with others. ENG.5.5.S1. Students can get ready for speaking-expression process about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses”. ENG.5.5.S2. Students can use the model/example for producing verbal content about the current content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ;different types of houses”. ENG.5.5.S3. Students can organize a new verbal content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” by speaking accurately, efficiently, and authentically. ENG.5.5.S4. Students can construct a new verbal content on “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” by speaking accurately, efficiently, and authentically. ENG.5.5.S5. Students can reorganize (reconstruct) and use information about the “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” to communicate with other people. ENG.5.5.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the neighborhood and city with places for recreation and attractions in the neighborhood and city ; different types of houses” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 27,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 21,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 22,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.6.L1",
    "code": "ENG.5.6.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city” carefully. ENG.5.6.L2. Students can bring information about the current conte t on “life in the world with basic food types; ordering in a restaurant; food events in the city” together through significant details and main components while listening/watching it. ENG.5.6.L3. Students can make meaning of/derive meaning from the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city” through significant details by listening/watching it carefully. ENG.5.6.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.P1. Students can select and use the target phonological elements of the current content about “life in the world with basic food types; ordering in a restaurant; food events in the city” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.6.R1. Students can get ready for the reading-comprehension process about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.R2. Students can bring information about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.6.R3. Students can make meaning of / derive meaning from the current content about “life in the world with basic food types; ordering in a restaurant; food events in the city” by reading it carefully. ENG.5.6.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the world with basic food types; ordering in a restaurant; food events in the city” in relation to themselves or others, both individually and/or with others. ENG.5.6.V1. Students can select and use the target vocabulary of the current content about “life in the world with basic food types; ordering in a restaurant; food events in the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.6.G1. Students can select and use the target grammatical elements of the current content about “life in the world with basic food types; ordering in a restaurant; food events in the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.6.W1. Students can get ready for the writing-expression process about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.W2. Students can understand the model/example for the writing task about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.W3. Students can organize a content for the assigned writing task on the current content “life in the world with basic food types; ordering in a restaurant; food events in the city” based on the model/example provided. ENG.5.6.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “life in the world with basic food types; ordering in a restaurant; food events in the city” to communicate with other people. ENG.5.6.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the world with basic food types; ordering in a restaurant; food events in the city” in relation to themselves or others, both individually and/or with others. ENG.5.6.S1. Students can get ready for speaking-expression process about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.S2. Students can use the model/example for producing verbal content about the current content on “life in the world with basic food types; ordering in a restaurant; food events in the city”. ENG.5.6.S3. Students can organize a new verbal content on “life in the world with basic food types; ordering in a restaurant; food events in the city” by speaking accurately, efficiently, and authentically. ENG.5.6.S4. Students can construct a new verbal content on “life in the world with basic food types; ordering in a restaurant; food events in the city” by speaking accurately, efficiently, and authentically. ENG.5.6.S5. Students can reorganize (reconstruct) and use information about the “life in the world with basic food types; ordering in a restaurant; food events in the city” to communicate with other people. ENG.5.6.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the world with basic food types; ordering in a restaurant; food events in the city” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 34,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 39,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 24,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 25,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG5.7.L1",
    "code": "ENG5.7.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats” carefully. ENG5.7.L2. Students can bring information about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats” together through significant details and main components while listening/watching it. ENG5.7.L3. Students can make meaning of/derive meaning from the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats” through significant details by listening/watching it carefully. ENG5.7.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.P1. Students can select and use the target phonological elements of the current content about “life in nature with types of animals in nature; wild animals in nature; their habitats” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG5.7.R1. Students can get ready for the reading-comprehension process about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.R2. Students can bring information about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG5.7.R 3. Students can make meaning of / derive meaning from the current content about “life in nature with types of animals in nature; wild animals in nature; their habitats” by reading it carefully. ENG5.7.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in nature with types of animals in nature; wild animals in nature; their habitats” in relation to themselves or others, both individually and/or with others. ENG5.7.V1. Students can select and use the target vocabulary of the current content about “life in nature with types of animals in nature; wild animals in nature; their habitats” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG5.7.G1. Students can select and use the target grammatical elements of the current content about “life in nature with types of animals in nature; wild animals in nature; their habitats” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG5.7.W1. Students can get ready for the writing-expression process about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.W2. Students can understand the model/example for the writing task about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.W3. Students can organize a content for the assigned writing task on the current content “life in nature with types of animals in nature; wild animals in nature; their habitats” based on the model/example provided. ENG5.7.W4. Students can individually construct/form content for the assigned writing task on the current content “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “life in nature with types of animals in nature; wild animals in nature; their habitats” to communicate with other people. ENG5.7.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in nature with types of animals in nature; wild animals in nature; their habitats” in relation to themselves or others, both individually and/or with others. ENG5.7.S1. Students can get ready for speaking-expression process about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.S2. Students can use the model/example for producing verbal content about the current content on “life in nature with types of animals in nature; wild animals in nature; their habitats”. ENG5.7.S3. Students can organize a new verbal content on “life in nature with types of animals in nature; wild animals in nature; their habitats” by speaking accurately, efficiently, and authentically. ENG5.7.S4. Students can construct a new verbal content on “life in nature with types of animals in nature; wild animals in nature; their habitats” by speaking accurately, efficiently, and authentically. ENG5.7.S5. Students can reorganize (reconstruct) and use information about the “life in nature with types of animals in nature; wild animals in nature; their habitats” to communicate with other people. ENG5.7.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in nature with types of animals in nature; wild animals in nature; their habitats” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 42,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.8.L1",
    "code": "ENG.5.8.L1",
    "statement": "Students can get ready for the listening (to)/watching-comprehension process for the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” carefully. ENG.5.8.L2. Students can bring information about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” together through significant details and main components while listening/watching it. ENG.5.8.L3. Students can make meaning of/derive meaning from the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” through significant details by listening/watching it carefully. ENG.5.8.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.P1. Students can select and use the target phonological elements of the current content about “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.8.R1. Students can get ready for the reading-comprehension process about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.R2. Students can bring information about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.8.R3. Students can make meaning of / derive meaning from the current content about “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” by reading it carefully. ENG.5.8.R 4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” in relation to themselves or others, both individually and/or with others. ENG.5.8.V1. Students can select and use the target vocabulary of the current content about “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.8.G1. Students can select and use the target grammatical elements of the current content about “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.8.W1. Students can get ready for the writing-expression process about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.W2. Students can understand the model/example for the writing task about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.W3. Students can organize a content for the assigned writing task on the current content “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” based on the model/example provided. ENG.5.8.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.W5. Students can reorganize (reconstruct) and use information in the new written tasks about the “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” to communicate with other people. ENG.5.8.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” in relation to themselves or others, both individually and/or with others. ENG.5.8.S1. Students can get ready for speaking-expression process about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.S2. Students can use the model/example for producing verbal content about the current content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays”. ENG.5.8.S3. Students can organize a new verbal content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” by speaking accurately, efficiently, and authentically. ENG.5.8.S4. Students can construct a new verbal content on “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” by speaking accurately, efficiently, and authentically. ENG.5.8.S5. Students can reorganize (reconstruct) and use information about the “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” to communicate with other people. ENG.5.8.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the universe and future with planet Earth; holidays; school holidays, places, activities, and plans for holidays” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 46,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "TYMM 5",
        "row": 50,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 29,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 30,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.7.L1",
    "code": "ENG.5.7.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” carefully. ENG.5.7.L2. Students can bring information about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” together through significant details and main components while listening (to)/watching it. ENG.5.7.L3. Students can make meaning of/derive meaning from the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” through significant details by listening (to)/watching it carefully. ENG.5.7.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.P1. Students can select and use the target phonological elements of the current content about “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.7.R1. Students can get ready for the reading-comprehension process about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.R2. Students can bring information about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.7.R3. Students can make meaning of / derive meaning from the current content about “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” by reading it carefully. ENG.5.7.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” in relation to themselves or others, both individually and/or with others. ENG.5.7.V1. Students can select and use the target vocabulary of the current content about “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.7.G1. Students can select and use the target grammatical elements of the current content about “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.7.W1. Students can get ready for the writing-expression process about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.W2. Students can understand the model/example for the writing task about the current ontent on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.W3. Students can organise a content for the assigned writing task on the current content “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” based on the model/example provided. ENG.5.7.W4. Students can individually construct/form content for the assigned writing task on the current content “life in nature with animals in nature and habitats; daily activities and nature; ctivities in nature”. ENG.5.7.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” to communicate with other people. ENG.5.7.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” in relation to themselves or others, both individually and/or with others. ENG.5.7.S1. Students can get ready for speaking-expression process about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.S2. Students can use the model/example for producing verbal content about the current content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature”. ENG.5.7.S3. Students can organise a new verbal content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” by speaking accurately, efficiently, and authentically. ENG.5.7.S4. Students can construct a new verbal content on “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” by speaking accurately, efficiently, and authentically. ENG.5.7.S5. Students can reorganise (reconstruct) and use information about the “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” to communicate with other people. ENG.5.7.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the peaking-expression process about the current content, “life in nature with animals in nature and habitats; daily activities and nature; activities in nature” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 26,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 28,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.9.L1",
    "code": "ENG.5.9.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” carefully. ENG.5.9.L2. Students can bring information about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” together through significant details and main components while listening (to)/watching it. ENG.5.9.L3. Students can make meaning of/derive meaning from the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” through significant details by listening (to)/watching it carefully. ENG.5.9.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” ENG.5.9.P1. Students can select and use the target phonological elements of the current content about “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.9.R1. Students can get ready for the reading-comprehension process about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.R2. Students can bring information about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.9.R3. Students can make meaning of / derive meaning from the current content about “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” by reading it carefully. ENG.5.9.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” in relation to themselves or others, both individually and/or with others. ENG.5.9.V1. Students can select and use the target vocabulary of the current content about “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.9.G1. Students can select and use the target grammatical elements of the current content about “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.9.W1. Students can get ready for the writing-expression process about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.W2. Students can understand the model/example for the writing task about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.W3. Students can organise a content for the assigned writing task on the current content “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” based on the model/example provided. ENG.5.9.W4. Students can individually construct/form content for the assigned writing task on the current content “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” to communicate with other people. ENG.5.9.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” in relation to themselves or others, both individually and/or with others. ENG.5.9.S1. Students can get ready for speaking-expression process about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.S2. Students can use the model/example for producing verbal content about the current content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school”. ENG.5.9.S3. Students can organise a new verbal content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” by speaking accurately, efficiently, and authentically. ENG.5.9.S4. Students can construct a new verbal content on “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” by speaking accurately, efficiently, and authentically. ENG.5.9.S5. Students can reorganise (reconstruct) and use information about the “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” to communicate with other people. ENG.5.9.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “school life and education with schools from different parts of the world; extracurricular activities at school; clubs at school” to communicate with other people in relation to themselves or others, both individually and/ or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 31,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 33,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.10.L1",
    "code": "ENG.5.10.L1",
    "statement": "Students can get ready for the listening /watching-comprehension process for the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” carefully. ENG.5.10.L2. Students can bring information about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” together through significant details and main components while listening(to)/watching it. ENG.5.10.L3. Students can make meaning of/derive meaning from the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” through significant details by listening(to)/watching it carefully. ENG.5.10.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” ENG.5.10.P1. Students can select and use the target phonological elements of the current content about “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.10.R1. Students can get ready for the reading-comprehension process about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers”. ENG.5.10.R2. Students can bring information about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.10.R3. Students can make meaning of / derive meaning from the current content about “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” by reading it carefully. ENG.5.10.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” in relation to themselves or others, both individually and/or with others. ENG.5.10.V1. Students can select and use the target vocabulary of the current content about “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.10.G1. Students can select and use the target grammatical elements of the current content about “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.10.W1. Students can get ready for the writing-expression process about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers”. ENG.5.10.W2. Students can understand the model/example for the writing task about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers”. ENG.5.10.W3. Students can organise a content for the assigned writing task on the current content “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” based on the model/example provided. ENG.5.10.W4. Students can individually construct/form content for the assigned writing task on the current content “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers”. ENG.5.10.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” to communicate with other people. ENG.5.10.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” in relation to themselves or others, both individually and/or with others. ENG.5.10.S1. Students can get ready for speaking-expression process about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” ENG.5.10.S2. Students can use the model/example for producing verbal content about the current content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” ENG.5.10.S3. Students can organise a new verbal content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” by speaking accurately, efficiently, and authentically. ENG.5.10.S4. Students can construct a new verbal content on “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” by speaking accurately, efficiently, and authentically. ENG.5.10.S5. Students can reorganise (reconstruct) and use information about the “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” to communicate with other people. ENG.5.10.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “classroom life and learning with technological classroom tools; learning activities in the classroom; cardinal numbers and ordinal numbers” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 32,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 34,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 38,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 39,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.11.L1",
    "code": "ENG.5.11.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” carefully. ENG.5.11.L2. Students can bring information about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” together through significant details and main components while listening (to)/watching it. ENG.5.11.L3. Students can make meaning of/derive meaning from the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” through significant details by listening (to)/watching it carefully. ENG.5.11.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” ENG.5.11.P1. Students can select and use the target phonological elements of the current content about “personal life and well-being with body parts; human illnesses and diseases; keeping good health” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.11.R1. Students can get ready for the reading-comprehension process about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.R2. Students can bring information about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.11.R3. Students can make meaning of / derive meaning from the current content about “personal life and well-being with body parts; human illnesses and diseases; keeping good health” by reading it carefully. ENG.5.11.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “personal life and well-being with body parts; human illnesses and diseases; keeping good health” in relation to themselves or others, both individually and/or with others. ENG.5.11.V1. Students can select and use the target vocabulary of the current content about “personal life and well-being with body parts; human illnesses and diseases; keeping good health” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.11.G1. Students can select and use the target grammatical elements of the current content about “personal life and well-being with body parts; human illnesses and diseases; keeping good health” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.11.W1. Students can get ready for the writing-expression process about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.W2. Students can understand the model/example for the writing task about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.W3. Students can organise a content for the assigned writing task on the current content “personal life and well-being with body parts; human illnesses and diseases; keeping good health” based on the model/example provided. ENG.5.11.W4. Students can individually construct/form content for the assigned writing task on the current content “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “personal life and well-being with body parts; human illnesses and diseases; keeping good health” to communicate with other people. ENG.5.11.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “personal life and well-being with body parts; human illnesses and diseases; keeping good health” in relation to themselves or others, both individually and/or with others. ENG.5.11.S1. Students can get ready for speaking-expression process about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.S2. Students can use the model/example for producing verbal content about the current content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health”. ENG.5.11.S3. Students can organise a new verbal content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” by speaking accurately, efficiently, and authentically. ENG.5.11.S4. Students can construct a new verbal content on “personal life and well-being with body parts; human illnesses and diseases; keeping good health” by speaking accurately, efficiently, and authentically. ENG.5.11.S5. Students can reorganise (reconstruct) and use information about the “personal life and wellbeing with body parts; human illnesses and diseases; keeping good health” to communicate with other people. ENG.5.11.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “personal life and well-being with body parts; human illnesses and diseases; keeping good health” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 40,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:085fef9ab7",
    "code": null,
    "statement": "\"ENG.5.12.L1. Students can get ready for the listening/watching-comprehension process for the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” carefully. ENG.5.12.L2. Students can bring information about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” together through significant details and main components while listening (to)/watching it. ENG.5.12.L3. Students can make meaning of/derive meaning from the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” through significant details by listening (to)/watching it carefully. ENG.5.12.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.P1. Students can select and use the target phonological elements of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.12.R1. Students can get ready for the reading-comprehension process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.R2. Students can bring information about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.12.R3. Students can make meaning of / derive meaning from the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by reading it carefully. ENG.5.12.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” in relation to themselves or others, both individually and/or with others. ENG.5.12.V1. Students can select and use the target vocabulary of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.12.G1. Students can select and use the target grammatical elements of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.12.W1. Students can get ready for the writing-expression process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W2. Students can understand the model/example for the writing task about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W3. Students can organise a content for the assigned writing task on the current content “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” based on the model/example provided. ENG.5.12.W4. Students can individually construct/form content for the assigned writing task on the current content “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people. ENG.5.12.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” in relation to themselves or others, both individually and/or with others. ENG.5.12.S1. Students can get ready for speaking-expression process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.S2. Students can use the model/example for producing verbal content about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.S3. Students can organise a new verbal content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by speaking accurately, efficiently, and authentically. ENG.5.12.S4. Students can construct a new verbal content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by speaking accurately, efficiently, and authentically. ENG.5.12.S5. Students can reorganise (reconstruct) and use information about the “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people. ENG.5.12.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 41,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:a1995c89c0",
    "code": null,
    "statement": "\"ENG.5.12.L1. Students can get ready for the listening/watching-comprehension process for the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” carefully. ENG.5.12.L2. Students can bring information about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” together through significant details and main components while listening (to)/watching it. ENG.5.12.L3. Students can make meaning of/derive meaning from the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” through significant details by listening (to)/watching it carefully. ENG.5.12.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.P1. Students can select and use the target phonological elements of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.12.R1. Students can get ready for the reading-comprehension process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.R2. Students can bring information about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.12.R3. Students can make meaning of / derive meaning from the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by reading it carefully. ENG.5.12.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” in relation to themselves or others, both individually and/or with others. ENG.5.12.V1. Students can select and use the target vocabulary of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.12.G1. Students can select and use the target grammatical elements of the current content about “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.12.W1. Students can get ready for the writing-expression process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W2. Students can understand the model/example for the writing task about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W3. Students can organise a content for the assigned writing task on the current content “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” based on the model/example provided. ENG.5.12.W4. Students can individually construct/form content for the assigned writing task on the current content “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses”. ENG.5.12.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people. ENG.5.12.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” in relation to themselves or others, both individually and/or with others. ENG.5.12.S1. Students can get ready for speaking-expression process about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.S2. Students can use the model/example for producing verbal content about the current content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” ENG.5.12.S3. Students can organise a new verbal content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by speaking accurately, efficiently, and authentically. ENG.5.12.S4. Students can construct a new verbal content on “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” by speaking accurately, efficiently, and authentically. ENG.5.12.S5. Students can reorganise (reconstruct) and use information about the “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people. ENG.5.12.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “family life and home with family members’ abilities and skills; hobbies of family members; different lifestyles of families in different houses” to communicate with other people in relation to themselves or others, both individually and/or with others. ENG.5.13.L1. Students can get ready for the listening/watching-comprehension process for the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” carefully. ENG.5.13.L2. Students can bring information about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” together through significant details and main components while listening (to)/watching it. ENG.5.13.L3. Students can make meaning of/derive meaning from the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” through significant details by listening (to)/watching it carefully. ENG.5.13.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.P1. Students can select and use the target phonological elements of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.13.R1. Students can get ready for the reading-comprehension process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.R2. Students can bring information about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.13.R3. Students can make meaning of / derive meaning from the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by reading it carefully. ENG.5.13.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” in relation to themselves or others, both individually and/or with others. ENG.5.13.V1. Students can select and use the target vocabulary of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.13.G1. Students can select and use the target grammatical elements of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.13.W1. Students can get ready for the writing-expression process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W2. Students can understand the model/example for the writing task about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W3. Students can organise a content for the assigned writing task on the current content “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” based on the model/example provided. ENG.5.13.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people. ENG.5.13.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” in relation to themselves or others, both individually and/or with others. ENG.5.13.S1. Students can get ready for speaking-expression process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.S2. Students can use the model/example for producing verbal content about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.S3. Students can organise a new verbal content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by speaking accurately, efficiently, and authentically. ENG.5.13.S4.Students can construct a new verbal content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by speaking accurately, efficiently, and authentically. ENG.5.13.S5.Students can reorganise (reconstruct) and use information about the “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people. ENG.5.13.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people in relation to themselves or others, both individually and/ or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 42,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.13.L1",
    "code": "ENG.5.13.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” carefully. ENG.5.13.L2. Students can bring information about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” together through significant details and main components while listening (to)/watching it. ENG.5.13.L3. Students can make meaning of/derive meaning from the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” through significant details by listening (to)/watching it carefully. ENG.5.13.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.P1. Students can select and use the target phonological elements of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.13.R1. Students can get ready for the reading-comprehension process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.R2. Students can bring information about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.13.R3. Students can make meaning of / derive meaning from the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by reading it carefully. ENG.5.13.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” in relation to themselves or others, both individually and/or with others. ENG.5.13.V1. Students can select and use the target vocabulary of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.13.G1. Students can select and use the target grammatical elements of the current content about “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.13.W1. Students can get ready for the writing-expression process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W2. Students can understand the model/example for the writing task about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W3. Students can organise a content for the assigned writing task on the current content “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” based on the model/example provided. ENG.5.13.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people. ENG.5.13.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” in relation to themselves or others, both individually and/or with others. ENG.5.13.S1. Students can get ready for speaking-expression process about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.S2. Students can use the model/example for producing verbal content about the current content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city”. ENG.5.13.S3. Students can organise a new verbal content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by speaking accurately, efficiently, and authentically. ENG.5.13.S4.Students can construct a new verbal content on “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” by speaking accurately, efficiently, and authentically. ENG.5.13.S5.Students can reorganise (reconstruct) and use information about the “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people. ENG.5.13.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the neighbourhood, city and social life with cultural and historical places in the neighbourhood and the city; festivals and events in the neighbourhood and the city; transportation in the neighbourhood and the city” to communicate with other people in relation to themselves or others, both individually and/ or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 43,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.14.L1",
    "code": "ENG.5.14.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” carefully. ENG.5.14.L2. Students can bring information about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” together through significant details and main components while listening (to)/watching it. ENG.5.14.L3. Students can make meaning of/derive meaning from the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” through significant details by listening (to)/watching it carefully. ENG.5.14.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.P1. Students can select and use the target phonological elements of the current content about “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.14.R1. Students can get ready for the reading-comprehension process about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.R2. Students can bring information about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.14.R3. Students can make meaning of / derive meaning from the current content about “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” by reading it carefully. ENG.5.14.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” in relation to themselves or others, both individually and/or with others. ENG.5.14.V1. Students can select and use the target vocabulary of the current content about “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.14.G1. Students can select and use the target grammatical elements of the current content about “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.14.W1. Students can get ready for the writing-expression process about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.W2. Students can understand the model/example for the writing task about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.W3. Students can organise a content for the assigned writing task on the current content “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” based on the model/example provided. ENG.5.14.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” to communicate with other people. ENG.5.14.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” in relation to themselves or others, both individually and/or with others. ENG.5.14.S1. Students can get ready for speaking-expression process about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.S2. Students can use the model/example for producing verbal content about the current content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)”. ENG.5.14.S3. Students can organise a new verbal content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” by speaking accurately, efficiently, and authentically. ENG.5.14.S4. Students can construct a new verbal content on “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” by speaking accurately, efficiently, and authentically. ENG.5.14.S5. Students can reorganise (reconstruct) and use information about the “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” to communicate with other people. ENG.5.14.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the world and culture with capitals of countries; landmarks and famous places in capitals and cities; sport events in various parts of the world and sports culture (fair play)” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 44,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 46,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.15.L1",
    "code": "ENG.5.15.L1",
    "statement": "Students can get ready for the listening/watching-comprehension process for the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” carefully. ENG.5.15.L2. Students can bring information about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” together through significant details and main components while listening (to)/watching it. ENG.5.15.L3. Students can make meaning of/derive meaning from the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” through significant details by listening (to)/watching it carefully. ENG.5.15.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.P1. Students can select and use the target phonological elements of the current content about “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” accurately, authentically, and naturally through spontaneous decisionmaking processes and use it in an appropriate and effective way when communicating with others. ENG.5.15.R1. Students can get ready for the reading-comprehension process about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.R2. Students can bring information about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.15.R3. Students can make meaning of / derive meaning from the current content about “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” by reading it carefully. ENG.5.15.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” in relation to themselves or others, both individually and/or with others. ENG.5.15.V1. Students can select and use the target vocabulary of the current content about “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.15.G1. Students can select and use the target grammatical elements of the current content about “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.15.W1. Students can get ready for the writing-expression process about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.W2. Students can understand the model/example for the writing task about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.W3. Students can organise a content for the assigned writing task on the current content “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” based on the model/example provided. ENG.5.15.W4. Students can individually construct/form content for the assigned writing task on the current content “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” to communicate with other people. ENG.5.15.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” in relation to themselves or others, both individually and/or with others. ENG.5.15.S1. Students can get ready for speaking-expression process about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.S2. Students can use the model/example for producing verbal content about the current content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals”. ENG.5.15.S3. Students can organise a new verbal content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” by speaking accurately, efficiently, and authentically. ENG.5.15.S4. Students can construct a new verbal content on “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” by speaking accurately, efficiently, and authentically. ENG.5.15.S5. Students can reorganise (reconstruct) and use information about the “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” to communicate with other people. ENG.5.15.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in nature with natural resources; animals in nature and their habitats; protecting natural resources and animals” to communicate with other people in relation to themselves or others, both individually and/ or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 47,
        "col": 6
      },
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 50,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "EN:5:ENG.5.16.L1",
    "code": "ENG.5.16.L1",
    "statement": "Students can get ready for the listening /watching-comprehension process for the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” carefully. ENG.5.16.L2. Students can bring information about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” together through significant details and main components while listening (to)/watching it. ENG.5.16.L3. Students can make meaning of/derive meaning from the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” through significant details by listening (to)/watching it carefully. ENG.5.16.L4. Students can convey their knowledge, experience, thoughts, and feelings examined carefully about the whole listening/watching-comprehension process in relation to the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” ENG.5.16.P1. Students can select and use the target phonological elements of the current content about “life in the universe and future with astronaut life on space stations; space explorations; life in the future” accurately, authentically, and naturally through spontaneous decision-making processes and use it in an appropriate and effective way when communicating with others. ENG.5.16.R1. Students can get ready for the reading-comprehension process about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future”. ENG.5.16.R2. Students can bring information about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” through skimming (looking quickly at) the audio-visual elements and reading the content very quickly. ENG.5.16.R3. Students can make meaning of / derive meaning from the current content about “life in the universe and future with astronaut life on space stations; space explorations; life in the future” by reading it carefully. ENG.5.16.R4. Students can convey their knowledge, experiences, thoughts, and feelings related to the reading-comprehension process about the current content, “life in the universe and future with astronaut life on space stations; space explorations; life in the future” in relation to themselves or others, both individually and/or with others. ENG.5.16.V1. Students can select and use the target vocabulary of the current content about “life in the universe and future with astronaut life on space stations; space explorations; life in the future” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.16.G1. Students can select and use the target grammatical elements of the current content about “life in the universe and future with astronaut life on space stations; space explorations; life in the future” accurately, authentically, spontaneously, and naturally and use it appropriately and effectively when communicating with others. ENG.5.16.W1. Students can get ready for the writing-expression process about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future”. ENG.5.16.W2. Students can understand the model/example for the writing task about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future”. ENG.5.16.W3. Students can organise a content for the assigned writing task on the current content “life in the universe and future with astronaut life on space stations; space explorations; life in the future” based on the model/example provided. ENG.5.16.W4. Students can individually construct/form content for the assigned writing task on the current content “life in the universe and future with astronaut life on space stations; space explorations; life in the future”. ENG.5.16.W5. Students can reorganise (reconstruct) and use information in the new written tasks about the “life in the universe and future with astronaut life on space stations; space explorations; life in the future” to communicate with other people. ENG.5.16.W6. Students can reflect on their knowledge, experiences, thoughts, and feelings related to the writing-expression process about the current content, “life in the universe and future with astronaut life on space stations; space explorations; life in the future” in relation to themselves or others, both individually and/or with others. ENG.5.16.S1. Students can get ready for speaking-expression process about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” ENG.5.16.S2. Students can use the model/example for producing verbal content about the current content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” ENG.5.16.S3. Students can organise a new verbal content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” by speaking accurately, efficiently, and authentically. ENG.5.16.S4. Students can construct a new verbal content on “life in the universe and future with astronaut life on space stations; space explorations; life in the future” by speaking accurately, efficiently, and authentically. ENG.5.16.S5. Students can reorganise (reconstruct) and use information about the “life in the universe and future with astronaut life on space stations; space explorations; life in the future” to communicate with other people. ENG.5.16.S6. Students can convey their knowledge, experiences, thoughts, and feelings related to the speaking-expression process about the current content, “life in the universe and future with astronaut life on space stations; space explorations; life in the future” to communicate with other people in relation to themselves or others, both individually and/or with others.",
    "grade": "5",
    "subject_code": "EN",
    "subject_name": "İngilizce",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "İngilizce ve ÇYDEM İngilizce Yıllık Planlar/İNGİLİZCE TYMM ÇYDEM TASLAK YILLIK PLANLAR 19.11.25.xlsx",
        "sheet": "ÇYDEM 5",
        "row": 51,
        "col": 6
      }
    ]
  }
]