[
  {
    "outcome_id": "DE:7:DE.7.1.SP3.1",
    "code": "DE.7.1.SP3.1",
    "statement": "– Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den Sprechprozess zum Thema Freundschaft vorbereiten und passende Redemittel anwenden. – Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Hör-/Sehverstehen zu den Themen „Mein bester Freund“, „Das Aussehen“ und „Die Charaktereigenschaften“ vorbereiten, um vertraute Redemittel, Adjektive und Beschreibungen zu erkennen und zu deuten. DE.7.1.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen „Freizeitaktivitäten mit der Familie und mit den Freunden“ erkennen, Bedeutungen und Zusammenhänge ableiten und diese in eigenen Worten wiedergeben. DE.7.1.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können die phonologischen Zielstrukturen zu den Themen bewusst wahrnehmen, gezielt üben und zunehmend korrekt, spontan und situationsangemessen anwenden. DE.7.1.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Leseverstehen zu den Themen vorbereiten, indem sie ihr Vorwissen aktivieren und Vermutungen über den Inhalt anstellen. DE.7.1.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können durch schnelles Überfliegen, gezieltes Lesen und genaues Lesen wesentliche Informationen, Hauptaussagen und Bedeutungen von Details aus den Texten zum Thema „Freizeitaktivitäten mit der Familie und mit den Freunden“ erfassen, den Inhalt differenziert verstehen und in eigenen Worten wiedergeben. DE.7.1.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den themenspezifischen Zielwortschatz zu den Themen gezielt erkennen, kontextbezogen verstehen und in mündlicher sowie schriftlicher Kommunikation anwenden. DE.7.1.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die grammatischen Zielstrukturen im Zusammenhang mit dem Thema Freundschaft gezielt erkennen, verstehen und diese sicher und angemessen in der mündlichen und schriftlichen Kommunikation anwenden. DE.7.1.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema Freundschaft vorbereiten und Inhalte zum besten Freund/zur besten Freundin planen. DE.7.1.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können einen kurzen zusammenhängenden Text über ihren besten Freund/ihre beste Freundin schreiben und dabei die im Unterricht eingeführten sprachlichen Mittel korrekt anwenden. DE.7.1.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den Sprechprozess zum Thema Freundschaft vorbereiten und passende Redemittel anwenden. DE.7.1.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können sich gezielt auf eine freie mündliche Äußerung über ihren besten Freund/ihre beste Freundin vorbereiten. DE.7.1.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können frei und zusammenhängend über ihren besten Freund/ihre beste Freundin sprechen und dabei geeignete sprachliche Mittel anwenden.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 4,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:7:DE.7.2.H1.1",
    "code": "DE.7.2.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Hör-/Sehverstehen zu den Themen „Lebensmittel“,„Getränke“, „Mein Lieblingsessen“, „Mein Lieblingsgetränk“ vorbereiten, um bekannte Redemittel, Lebensmittel- und Getränkenamen sowie einfache Aussagen über Vorlieben zu erkennen und zu deuten. DE.7.2.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen, bedeutende Details sowie inhaltliche Beziehungen zu den Themen erkennen, verstehen und diese sinnvoll verknüpfen. DE.7.2.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können die phonologischen Zielstrukturen zum aktuellen Inhalt gezielt, authentisch und natürlich auswählen und anwenden. Sie können diese spontan und in der Kommunikation mit anderen angemessen und wirksam nutzen. DE.7.2.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Leseverstehen zum Thema vorbereiten und ihr Vorwissen aktivieren. Die Schüler können sich sprachlich und inhaltlich auf das Leseverstehen vorbereiten. DE.7.2.L2.3. –Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen von Texten zum Thema wesentliche Informationen, bedeutende Details sowie Zusammenhänge und Bedeutungen erfassen und in eigenen Worten wiedergeben. DE.7.2.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Zielwortschatz zum Thema „Essen und Trinken“ gezielt erkennen und anwenden. Sie können einfache Sätze bilden, Fragen stellen, beantworten und über ihre Vorlieben sprechen. DE.7.2.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die grundlegenden grammatischen Strukturen zum Thema gezielt erkennen und anwenden. Sie können über Vorlieben zum Essen und zum Trinken sprechen, höfliche Bestellungen formulieren und Negationen korrekt benutzen. DE.7.2.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema vorbereiten. Sie können ihr Vorwissen über Lebensmittel und Getränke aktivieren, um einfache Sätze und kurze Texte zu ihrem Lieblingsessen und Lieblingsgetränk zu formulieren. DE.7.2.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können einen kurzen zusammenhängenden Text zum Thema schreiben und dabei die gelernten Strukturen und Redemittel korrekt anwenden. DE.7.2.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf den Sprechprozess zum Thema vorbereiten. Sie können bekannte Redemittel und Satzmuster aktivieren, um sich mündlich über Essens- und Trinkgewohnheiten zu äußern. DE.7.2.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können ihren mündlichen Beitrag zum Thema sinnvoll strukturieren und relevante Inhalte auswählen. DE.7.2.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können einfache zusammenhängende mündliche Beiträge zum Thema „Essen und Trinken“ produzieren.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 12,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 15,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 20,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:7:DE.7.3.H1.1",
    "code": "DE.7.3.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für Hör/Sehverstehen zu den Themen Freizeitaktivitäten mit der Familie und Freizeitaktivitäten mit Freunden vorbereiten. Sie können dabei vertraute Redemittel und Bezeichnungen für Freizeitaktivitäten erkennen und deuten. DE.7.3.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen erkennen, vergleichen und zusammenfassend darstellen. DE.7.3.P3.1. - Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale Ausspracheregeln und Satzintonationsmuster im Kontext des Themas Freizeitaktivitäten am Wochenende erkennen und gezielt anwenden. DE.7.3.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf das Leseverstehen zum Thema Freizeitaktivitäten am Wochenende vorbereiten, indem sie ihr Vorwissen aktivieren und Strategien zur Texterwartung anwenden. DE.7.3.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können zentrale und detaillierte Informationen aus Lesetexten über Freizeitaktivitäten am Wochenende erfassen, verstehen und für die eigene Kommunikation nutzen. DE.7.3.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den thematischen Wortschatz zu Freizeitaktivitäten am Wochenende gezielt erkennen, verstehen und in eigenen mündlichen und schriftlichen Äußerungen anwenden. DE.7.3.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die grundlegenden grammatischen Strukturen im Kontext des Themas Freizeitaktivitäten am Wochenende erkennen und korrekt anwenden. DE.7.3.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können einfache Informationen zu ihren Freizeitaktivitäten am Wochenende sammeln und diese für einen eigenen kurzen Text vorbereiten. DE.7.3.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können einfache, zusammenhängende Texte über ihre eigenen Freizeitaktivitäten am Wochenende schreiben. DE.7.3.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können über ihre eigenen Freizeitaktivitäten am Wochenende in einfachen Sätzen sprechen. DE.7.3.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können sich in der Gruppe über ihre Wochenendpläne austauschen und einfache Dialoge führen. DE.7.3.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können ihre eigenen Freizeitaktivitäten am Wochenende in einer kurzen mündlichen Präsentation zusammenhängend darstellen.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 23,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 31,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:7:DE.7.4.H1.1",
    "code": "DE.7.4.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können beim Zuhören/Zusehen zentrale Informationen und Kernaussagen zu den Themen Körperteile, Krankheiten sowie Gesundheitstipps und Ratschläge erkennen und verstehen. DE.7.4.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Details erkennen und einfache Schlussfolgerungen zu den Themen Körperteile, Krankheiten und Gesundheitstipps und Ratschläge ziehen. DE.7.4.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale Ausspracheregeln und Intonationsmuster im Kontext der Themen Körperteile, Krankheiten sowie Gesundheitstipps und Ratschläge erkennen und gezielt anwenden. DE.7.4.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können zentrale Informationen und Kernaussagen in kurzen Lesetexten zum Thema Körperteile, Krankheiten und Gesundheitstipps erfassen und verstehen. DE.7.4.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können detaillierte Informationen in Lesetexten zu den Themen Körperteile, Krankheiten und Gesundheitstipps verstehen und für ihre eigene Kommunikation nutzen. DE.7.4.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Zielwortschatz zu den Themen Körperteile, Krankheiten und Gesundheitstipps gezielt erkennen, in unterschiedlichen Kontexten verstehen und situationsgerecht anwenden. DE.7.4.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können, die für das Thema Körper und Gesundheit relevanten Zielgrammatikelemente erkennen, in verschiedenen kommunikativen Kontexten verstehen und angemessen anwenden. DE.7.4.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema Körper, Krankheiten, Gesundheitstipps und Ratschläge vorbereiten können, um relevante Redemittel und Strukturen sicher anzuwenden. DE.7.4.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können selbstständig einfache schriftliche Texte zum Thema Körper und Gesundheit verfassen, DE.7.4.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf mündliche Aussagen und Dialoge zum Thema Körper und Gesundheit vorbereiten. DE.7.4.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können Inhalte zum Thema Körper und Gesundheit sinnvoll organisieren und in einfachen Sprechsituationen anwenden. DE.7.4.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können selbstständig und situationsangemessen mündliche Aussagen zum Thema Körper und Gesundheit formulieren.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 37,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:7:DE.7.5.H1.1",
    "code": "DE.7.5.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können beim Zuhören/Zusehen zentrale Informationen und Kernaussagen zu den Themen Regeln zu Hause, Hausarbeiten in der Familie, Tagesablauf zu Hause und Gutes Benehmen in der Familie erkennen und verstehen. DE.7.5.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Details erkennen und einfache Schlussfolgerungen zu den Themen Regeln zu Hause, Hausarbeiten in der Familie, Tagesablauf zu Hause und Gutes Benehmen in der Familie ziehen. DE.7.5.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale Ausspracheregeln und Intonationsmuster im Kontext der Themen erkennen und Redemittel sowie Satzelodien klar und verständlich aussprechen. DE.7.5.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können zentrale Informationen und Kernaussagen in kurzen Lesetexten zu den Themen erfassen und verstehen. DE.7.5.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können detaillierte Informationen in Lesetexten zu den Themen verstehen und für ihre eigene Kommunikation nutzen. DE.7.5.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Wortschatz zu den Themen Regeln zu Hause, Hausarbeiten, Tagesablauf und Gutes Benehmen gezielt und situationsgerecht anwenden. DE.7.5.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die für das Thema Regeln zu Hause relevanten Zielgrammatikelemente erkennen, in verschiedenen kommunikativen Kontexten verstehen und angemessen anwenden. DE.7.5.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema vorbereiten. Sie können dabei geeignete Redemittel und Strukturen anwenden und eigene kurze zusammenhängende Texte zu diesen Themen planen und schreiben. DE.7.5.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können einfache schriftliche Texte zu den Themen Regeln, Hausarbeiten und Tagesablauf zu Hause sowie zu gutem Benehmen in der Familie planen und verfassen. DE.7.5.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf mündliche Aussagen und Dialoge zu den Themen Regeln, Hausarbeiten und gutes Benehmen in der Familie vorbereiten und geeignete Redemittel sicher anwenden. DE.7.5.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können Inhalte zu den Themen Regeln zu Hause, Hausarbeiten, Tagesablauf und Gutes Benehmen einfach formulieren und in Sprechsituationen anwenden. DE.7.5.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können mündliche Aussagen zu den Themen Regeln zu Hause, Hausarbeiten, Tagesablauf und Gutes Benehmen formulieren und präsentieren.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 50,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:7:DE.7.6.H1.1",
    "code": "DE.7.6.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können beim Zuhören und Zusehen zentrale Informationen und Kernaussagen zu den Themen Reisevorbereitungen, Sehenswürdigkeiten und Verkehrsmittel auf einer Reise erkennen und verstehen. DE.7.6.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören und Zusehen wichtige Details erkennen, deren Bedeutung im Kontext erfassen und einfache Schlussfolgerungen zu den Themen Reisevorbereitungen, Sehenswürdigkeiten und Verkehrsmittel ziehen und formulieren. DE.7.6.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale Ausspracheregeln und Intonationsmuster im Kontext der Themen Reisevorbereitungen, Sehenswürdigkeiten und Verkehrsmittel erkennen und anwenden. DE.7.6.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können zentrale Informationen und Kernaussagen in kurzen Lesetexten zu den Themen Reiseziele, Reisevorbereitungen und Verkehrsmittel erkennen, erfassen und verstehen. DE.7.6.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können detaillierte Informationen in Lesetexten zu den Themen Reisevorbereitungen, Sehenswürdigkeiten und Verkehrsmittel verstehen und für ihre eigene Kommunikation nutzen. DE.7.6.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Zielwortschatz zu den Themen Reiseziele, Reisevorbereitungen, Verkehrsmittel und Sehenswürdigkeiten erkennen, verstehen und in eigenen Kommunikationssituationen anwenden. DE.7.6.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die für die Themen Reiseziele und Reisen relevanten Zielgrammatikelemente erkennen, verstehen und in mündlichen und schriftlichen Kommunikationssituationen korrekt anwenden. DE.7.6.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf den Schreibprozess zum Thema Reiseziele, Reisevorbereitungen, Verkehrsmittel, Sehenswürdigkeiten vorbereiten können, um relevante Redemittel und Satzstrukturen sicher anwenden zu können. DE.7.6.S4.4. – Inhalt vorbereiten und schreiben Lernziel: Die Schüler können selbstständig einfache schriftliche Texte zum Thema Reiseziele, Reisevorbereitungen, Verkehrsmittel, Sehenswürdigkeiten verfassen können. DE.7.6.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich gezielt auf mündliche Aussagen und Dialoge zu den Themen Reiseziele und Reisevorbereitungen vorbereiten und diese in unterschiedlichen Kommunikationssituationen sicher anwenden. DE.7.6.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können Inhalte zu den Themen Reiseziele und Reisevorbereitungen sinnvoll organisieren und in einfachen Sprechsituationen klar und situationsgerecht anwenden. DE.7.6.SP3.4. – Mündliche Inhalte produzieren Lernziel: Die Schüler können selbstständig und situationsangemessen mündliche Aussagen zu den Themen Reiseziele und Reisevorbereitungen formulieren und in verschiedenen Gesprächssituationen anwenden.",
    "grade": "7",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 59,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "7.Sınıf",
        "row": 67,
        "col": 6
      }
    ]
  }
]