[
  {
    "outcome_id": "TR:5:T.D.5.1",
    "code": "T.D.5.1",
    "statement": "Dinlemede/izlemede materyal seçimini yönetebilme a) Dinleme/izleme şekli (etkileşimli veya etkileşimsiz), amacı, ilgi ve ihtiyaçları, bilgiye erişim olanakları; etkinliğin süresi doğrultusunda dinleme/izleme materyalini ve diğer kaynakları (sözlük, genel ağ, çalışma kâğıdı, grafik organize edici vb.) seçer. b) Seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. c) Etkileşimli dinleme/izleme sırasında karşısındakiyle ilişkiyi sürdürür. T.D.5.4. Dinlediğinde/izlediğinde geçen anlamını bilmediği söz varlığı unsurlarının anlamını tahmin edebilme a) Dinlediğinin/izlediğinin bağlamından söz varlığı unsurlarının anlamıyla ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Söz varlığı unsurlarının anlamına ilişkin mantıklı tahminde bulunur. c) Tahminin doğruluğunu kaynaklardan (sözlük, başvuru kitapları vb.), ebeveyn veya öğretmenden yardım alarak kontrol edip yargıya ulaşır. T.D.5.5. Dinlediğinin/izlediğinin yüzey anlamını belirleyebilme a) Dinlediği/izlediği ve varsa ona eşlik eden görsellerden hareketle bağlama/konuya dair ipuçlarını bulup ön bilgileriyle bağlantı kurar. b) Dinlediğinde/izlediğinde doğrudan verilen bilgileri (tanımı verilen kavram, düşünce, yönerge, iletilmek istenen mesaj, açıkça ifade edilen ana fikir vb.) belirler. c) Uygun durumlarda, iletilen mesajın gerektirdiği tepkiyi verir. T.D.5.19. Dinlediğinden/izlediğinden hareketle söz varlığını geliştirmeye yönelik çözümleme yapabilme a) Dinlediğinin/izlediğinin anahtar söz varlığı unsurlarını belirler. b) Belirlenen söz varlığı unsurlarının anlam ilişkilerini inceler. T.D.5.25. Dinleme/izleme sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Dinleme/izleme sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp, güçlü yönlerini sonraki çalışmalara aktararak dinleyici/izleyici kimliğinin gelişimine yön verir.",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "OYUN DÜNYASI",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 22,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 25,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 33,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 39,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 52,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 61,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 69,
        "col": 7
      }
    ]
  },
  {
    "outcome_id": "TR:5:T.O.5.1",
    "code": "T.O.5.1",
    "statement": "Okumada materyal seçimini yönetebilme a) Amacı, ilgi ve ihtiyaçları, materyalin özellikleri, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda metin ve diğer yardımcı materyalleri (sözlük, ek kaynak vb.) seçer. c) Seçimleri üzerinde zamana bağlı değişime/üst bilişsel izlemeye dayalı düzenlemeler yapar. T.O.5.2. Sesli ve sessiz okurken akıcı okuma unsurlarını yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Metnin tür özellikleri ve içeriğinden hareketle okuma hızı, duraklama, vurgu, tonlama ve telaffuzu, anlamı yansıtacak biçimde düzenleyerek metni sesli okur. c) Metnin tür özellikleri ve içeriğinden hareketle okuma hızı ve duraklamaları, anlamı yansıtacak biçimde düzenleyerek metni sessiz okur. T.O.5.3. Okumada strateji ve yöntem seçimlerini yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda okurken kullanacağı strateji ve yöntemleri seçer ve seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.O.5.5. Metinde geçen anlamını bilmediği söz varlığı unsurlarının anlamını tahmin edebilme a) Metnin bağlamından söz varlığı unsurlarının anlamıyla ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Söz varlığı unsurlarının anlamına ilişkin mantıklı tahminde bulunur. c) Tahminin doğruluğunu kaynaklardan (sözlük, başvuru kitapları), ebeveyn veya öğretmenden yardım alarak kontrol edip yargıya ulaşır. T.O.5.6. Metnin yüzey anlamını belirleyebilme a) Metin ve varsa ona eşlik eden görsellerden hareketle bağlama/konuya dair ipuçlarını bulup ön bilgileriyle bağlantı kurar. b) Metinde doğrudan verilen bilgileri (tanımı verilen kavram, düşünce, yönerge, iletilmek istenen mesaj, açıkça ifade edilen ana fikir vb.) belirler. c) Gerektiğinde iletilen mesajın gerektirdiği tepkiyi verir. T.O.5.21. Metinden hareketle söz varlığını geliştirmeye yönelik çözümleme yapabilme a) Metnin anahtar söz varlığı unsurlarını belirler. b) Belirlenen söz varlığı unsurlarının anlam ilişkilerini inceler. T.O.5.27. Okuma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Okuma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak okur kimliğinin gelişimine yön verir.",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "OYUN DÜNYASI",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 22,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 39,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 52,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 61,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 69,
        "col": 10
      }
    ]
  },
  {
    "outcome_id": "TR:5:T.K.5.1",
    "code": "T.K.5.1",
    "statement": "Konuşma sürecini yönetebilme a) Konuşmayı başlatma, sürdürme, sonlandırmayla ilgili selam, hitap ve sonlandırma ifadelerini kullanır. b) Uygun zamanda söz alır/verir. c) Olay, konu, durum, problem vb. ile ilgili anlaşılmayan noktaları açıklığa kavuşturmak için herhangi bir yönlendirmenin etkisinde kalmadan soru sorar. ç) Kendisine yöneltilen soruları cevaplar. T.K.5.3. Konuşmasında amaç ve içeriğe yönelik seçimlerini yönetebilme a) Konuşma amacını belirler. b) Konuşma konusunu belirler. c) Konuşma türünü belirler. T.K.5.4. Konuşmasında ön bilgilerinden yararlanabilme a) Konuyla ilgili ön bilgilerini (gözlem, anı, deneyim, güncel olay, haber vb.) belirler. b) Ön bilgilerini konuşma içeriğiyle ilişkilendirir. c) Belirlediği ön bilgileri konuşmasına aktarır. T.K.5.9. Konuşmasında sesini uygun şekilde kullanabilme a) Nefesini doğru ayarlar. b) Kelimeleri doğru telaffuz eder. c) Sesin şiddetini ayarlar. ç) Doğru vurgu ve tonlamayla konuşur. T.K.5.22. Konuşmasını zenginleştirecek biçimde söz varlığını kullanabilme a) Kullanacağı söz varlığı unsurlarını aralarındaki anlam ilişkilerini dikkate alarak belirler. b) Aynı anlamı farklı söz varlığı unsurlarıyla (eş ve yakın anlamlı kelime, zıt anlamlı ve eş sesli kelime, çağrıştırdığı kelime; atasözü, deyim, kalıp söz, terim, ikileme, pekiştirme) ifade eder. c) Söz varlığı unsurlarını bağlama uygun kullanır. T.K.5.26. Konuşma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Konuşma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak konuşan kimliğinin gelişimine yön verir. c) Konuşmalarından oluşan ürün ve seçki dosyası (ses kaydı, konuşma metni, sunum videosu, çoklu medya ögeleri vb.) oluşturur.",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "OYUN DÜNYASI",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 22,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 25,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 33,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 39,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 52,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 61,
        "col": 11
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 69,
        "col": 11
      }
    ]
  },
  {
    "outcome_id": "TR:5:T.Y.5.1",
    "code": "T.Y.5.1",
    "statement": "Yazma sürecini yönetebilme a) Amaç, bağlam ve olanaklarını analiz ederek yazma konusunu, hedef kitlesini, dijital de dâhil yazma aracı ve ortamını belirler. b) Yazılı etkileşiminde yazışmayı başlatma, sürdürme ve sonlandırmayla ilgili uygun selam ve hitap ifadelerini kullanır. c) Yazılı üretim ve yazılı etkileşiminde içerik ve süreçle ilgili gerekli seçim ve düzenlemeleri yapar. T.Y.5.3. Yazısında içerik ve yapıya yönelik seçimlerini yönetebilme a) Yazma amacına uygun paragraf türünü seçer. b) Yazma amacına uygun metin yapısını seçer. T.Y.5.4. Yazılı üretim ve yazılı etkileşiminde ön bilgilerinden yararlanabilme a) Konuyla ilgili ön bilgilerini (gözlem, anı, deneyim, güncel olay, haber vb.) belirler. b) Ön bilgilerini yazma konusuyla ilişkilendirir. c) Belirlediği ön bilgileri yazısına aktarır. T.Y.5.18. Yazısını zenginleştirecek biçimde söz varlığını kullanabilme a) Kullanacağı söz varlığı unsurlarını aralarındaki anlam ilişkilerini dikkate alarak belirler. b) Aynı anlamı farklı söz varlığı unsurlarıyla (eş ve yakın anlamlı kelime, zıt anlamlı ve eş sesli kelime, çağrıştırdığı kelime; atasözü, deyim, kalıp söz, terim, ikileme, pekiştirme) ifade eder. c) Söz varlığı unsurlarını bağlama uygun kullanır. ç) Gerektiğinde yazısında söz varlığı unsurlarının görsel karşılığını kullanır. T.Y.5.21. Yazım kuralları ve noktalama işaretlerini uygulayabilme a) Yazım kurallarını uygular. b) Noktalama işaretlerini uygun biçimde kullanır. T.Y.5.22. Yazma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Yazma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak yazar kimliğinin gelişimine yön verir. c) Yazılarından oluşan ürün ve seçki dosyası (sözlük, günlük, anı, gezi, şiir, alıntılar seçkisi, atasözü ve deyim vb.) oluşturur.",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "OYUN DÜNYASI",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 22,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 25,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 33,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 39,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 52,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 61,
        "col": 12
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 69,
        "col": 12
      }
    ]
  },
  {
    "outcome_id": "TR:5:SDB1.1",
    "code": "SDB1.1",
    "statement": "Kendini Tanıma (Öz Farkındalık Becerisi) SDB1.2. Kendini Düzenleme (Öz Düzenleme Becerisi) SDB1.3. Kendini Uyarlama (Öz Yansıtma) SDB2.1. İletişim SDB2.2. İş Birliği SDB3.2. Esneklik",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "OYUN DÜNYASI",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 22,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 25,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 33,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 39,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 52,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 61,
        "col": 15
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 69,
        "col": 15
      }
    ]
  },
  {
    "outcome_id": "TR:5:T.O.5.3",
    "code": "T.O.5.3",
    "statement": "Okumada strateji ve yöntem seçimlerini yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda okurken kullanacağı strateji ve yöntemleri seçer ve seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.O.5.8. Metnin derin anlamını belirlemeye yönelik basit çıkarımlar yapabilme a) Metnin sınırlı bir bölümünden ve görselden kanıt toplayıp ön bilgileriyle ilişkilendirir. b) İlişkilendirmeden hareketle çıkarım yapar. c) Bir yargıya vararak gerektiğinde tepki verir. T.O.5.17. Metnin bölümlerini belirlemeye yönelik çözümleme yapabilme a) Metnin türüne uygun olarak giriş, gelişme, sonuç veya serim, düğüm, çözüm bölümlerini belirler. b) Metnin bölümlerinin birbirleriyle bağlantısını belirler. T.O.5.18. Şiirin biçim özelliklerini belirlemeye yönelik çözümleme yapabilme a) Okuduğu şiirin biçim özelliklerini belirler. b) Şiirin biçim özelliklerinin birbirleriyle ve metinle ilişkisini ortaya koyar. T.O.5.19. Bilgilendirici metinde düşünceyi geliştirme yollarını belirlemeye yönelik çözümleme yapabilme a) Yazarın başvurduğu düşünceyi geliştirme yollarını belirler. b) Belirlediği düşünceyi geliştirme yollarının birbirleriyle ve metinle ilişkisini ortaya koyar. T.O.5.20. Metindeki söz sanatlarını belirlemeye yönelik çözümleme yapabilme a) Okuduklarındaki söz sanatlarını belirler. b) Söz sanatlarının metnin anlatımıyla ilişkisini ortaya koyar. T.O.5.27. Okuma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Okuma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak okur kimliğinin gelişimine yön verir.",
    "grade": "5",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DUYGULARIMI TANIYORUM",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 25,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": " 5.SINIF ÇERÇEVE YILLIK PLAN",
        "row": 33,
        "col": 10
      }
    ]
  }
]