[
  {
    "outcome_id": "TR:6:T.D.6.1",
    "code": "T.D.6.1",
    "statement": "Dinlemede/izlemede materyal seçimini yönetebilme a) Dinleme/izleme şekli (etkileşimli veya etkileşimsiz), amacı, ilgi ve ihtiyaçları, bilgiye erişim olanakları; etkinliğin süresi doğrultusunda dinleme/izleme materyalini ve diğer kaynakları (sözlük, genel ağ, çalışma kâğıdı, grafik organize edici vb.) seçer. b) Seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. c) Etkileşimli dinleme/izleme sırasında karşısındakiyle ilişkiyi sürdürür. T.D.6.2. Dinlemede/izlemede strateji ve yöntem seçimlerini yönetebilme a) Dinleme/izleme şekli (etkileşimli veya etkileşimsiz), amacı, ilgi ve ihtiyaçları; materyalin özellikleri ve etkinliğin süresi doğrultusunda kullanacağı strateji ve yöntemleri seçer. b) Seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.D.6.4. Dinlediğinde/izlediğinde geçen anlamını bilmediği söz varlığı unsurlarının anlamını tahmin edebilme a) Dinlediğinin/izlediğinin bağlamından söz varlığı unsurlarının anlamıyla ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Söz varlığı unsurlarının anlamına ilişkin mantıklı tahminde bulunur. c) Tahminin doğruluğunu kaynaklardan (sözlük, başvuru kitapları vb.), ebeveyn veya öğretmenden yardım alarak kontrol edip yargıya ulaşır. T.D.6.5. Dinlediğinin/izlediğinin yüzey anlamını belirleyebilme a) Dinlediği/izlediği ve varsa ona eşlik eden görsellerden hareketle bağlama/konuya dair ipuçlarını bulup ön bilgileriyle bağlantı kurar. b) Dinlediğinde/izlediğinde doğrudan verilen bilgileri (tanımı verilen kavram, düşünce, yönerge, iletilmek istenen mesaj, açıkça ifade edilen ana fikir vb.) belirler. c) Uygun durumlarda, iletilen mesajın gerektirdiği tepkiyi verir. T.D.6.15. Bilgilendirici metinde anahtar kelimeleri belirlemeye yönelik çözümleme yapabilme a) Metnin içeriğini yansıtan anahtar kelimeleri belirler. b) Anahtar kelimelerin dinlediğiyle/izlediğiyle ilişkisini ortaya koyar. T.D.6.19. Dinlediğinden/izlediğinden hareketle söz varlığını geliştirmeye yönelik çözümleme yapabilme a) Dinlediğinin/izlediğinin anahtar söz varlığı unsurlarını belirler. b) Belirlenen söz varlığı unsurlarının anlam ilişkilerini inceler. T.D.6.25. Dinleme/izleme sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Dinleme/izleme sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak dinleyici/izleyici kimliğinin gelişimine yön verir.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DİLİMİZİN ZENGİNLİĞİ",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 21,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 29,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 35,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 57,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 65,
        "col": 7
      }
    ]
  },
  {
    "outcome_id": "TR:6:T.O.6.1",
    "code": "T.O.6.1",
    "statement": "Okumada materyal seçimini yönetebilme a) Amacı, ilgi ve ihtiyaçları, materyalin özellikleri, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda metin ve diğer yardımcı materyalleri (sözlük, ek kaynak vb.) seçer. c) Seçimleri üzerinde zamana bağlı değişime/üst bilişsel izlemeye dayalı düzenlemeler yapar. T.O.6.2. Sesli ve sessiz okurken akıcı okuma unsurlarını yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Metnin tür özellikleri ve içeriğinden hareketle okuma hızı, duraklama, vurgu, tonlama ve telaffuzu, anlamı yansıtacak biçimde düzenleyerek metni sesli okur. c) Metnin tür özellikleri ve içeriğinden hareketle okuma hızı ve duraklamaları, anlamı yansıtacak biçimde düzenleyerek metni sessiz okur. T.O.6.3. Okumada strateji ve yöntem seçimlerini yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda okurken kullanacağı strateji ve yöntemleri seçer ve seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.O.6.4. Okuyacağı metnin içeriğine yönelik tahminde bulunabilme a) Okuyacağı metnin başlık, görsel ve/veya belirli bir bölümünden hareketle içerikle ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Metnin içeriği veya sonraki bölümleriyle ilgili mantıklı tahminde bulunur. c) Tahmininin doğruluğunu kontrol edip yargıya ulaşır. T.O.6.5. Metinde geçen anlamını bilmediği söz varlığı unsurlarının anlamını tahmin edebilme a) Metnin bağlamından söz varlığı unsurlarının anlamıyla ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Söz varlığı unsurlarının anlamına ilişkin mantıklı tahminde bulunur. c) Tahminin doğruluğunu kaynaklardan (sözlük, başvuru kitapları), ebeveyn veya öğretmenden yardım alarak kontrol edip yargıya ulaşır. T.O.6.6. Metnin yüzey anlamını belirleyebilme a) Metin ve varsa ona eşlik eden görsellerden hareketle bağlama/konuya dair ipuçlarını bulup ön bilgileriyle bağlantı kurar. b) Metinde doğrudan verilen bilgileri (tanımı verilen kavram, düşünce, yönerge, iletilmek istenen mesaj, açıkça ifade edilen ana fikir vb.) belirler. c) Gerektiğinde iletilen mesajın gerektirdiği tepkiyi verir. T.O.6.16. Bilgilendirici metinde anahtar kelimeleri belirlemeye yönelik çözümleme yapabilme a) Metnin içeriğini yansıtan anahtar kelimeleri belirler. b) Anahtar kelimelerin metinle ilişkisini ortaya koyar. T.O.6.21. Metinden hareketle söz varlığını geliştirmeye yönelik çözümleme yapabilme a) Metnin anahtar söz varlığı unsurlarını belirler. b) Belirlenen söz varlığı unsurlarının anlam ilişkilerini inceler. T.O.6.27. Okuma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Okuma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak okur kimliğinin gelişimine yön verir.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DİLİMİZİN ZENGİNLİĞİ",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 21,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 29,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 35,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 57,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 65,
        "col": 8
      }
    ]
  },
  {
    "outcome_id": "TR:6:T.K.6.1",
    "code": "T.K.6.1",
    "statement": "Konuşma sürecini yönetebilme a) Konuşmayı başlatma, sürdürme, sonlandırmayla ilgili selam, hitap ve sonlandırma ifadelerini kullanır. b) Uygun zamanda söz alır/verir. c) Olay, konu, durum, problem vb. ile ilgili anlaşılmayan noktaları açıklığa kavuşturmak için herhangi bir yönlendirmenin etkisinde kalmadan soru sorar. ç) Kendisine yöneltilen soruları cevaplar. T.K.6.2. Konuşma yöntem ve tekniklerine yönelik seçimlerini yönetebilme a) Konuşma şekli (sözlü üretim veya sözlü etkileşim), amacı, süresi, ilgi ve ihtiyaçları doğrultusunda kullanacağı yöntem ve teknikleri seçer. b) Seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.K.6.3. Konuşmasında amaç ve içeriğe yönelik seçimlerini yönetebilme a) Konuşma amacını belirler. b) Konuşma konusunu belirler. c) Konuşma türünü belirler. T.K.6.9. Konuşmasında sesini uygun şekilde kullanabilme a) Nefesini doğru ayarlar. b) Kelimeleri doğru telaffuz eder. c) Sesin şiddetini ayarlar. ç) Doğru vurgu ve tonlamayla konuşur. T.K.6.22. Konuşmasını zenginleştirecek biçimde söz varlığını kullanabilme a) Kullanacağı söz varlığı unsurlarını aralarındaki anlam ilişkilerini dikkate alarak belirler. b) Aynı anlamı farklı söz varlığı unsurlarıyla (eş ve yakın anlamlı kelime, zıt anlamlı ve eş sesli kelime, çağrıştırdığı kelime; atasözü, deyim, kalıp söz, terim, ikileme, pekiştirme) ifade eder. c) Söz varlığı unsurlarını bağlama uygun kullanır. T.K.6.26. Konuşma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Konuşma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak konuşan kimliğinin gelişimine yön verir. c) Konuşmalarından oluşan ürün ve seçki dosyası (ses kaydı, konuşma metni, sunum videosu, çoklu medya ögeleri vb.) oluşturur.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DİLİMİZİN ZENGİNLİĞİ",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 18,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 21,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 29,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 35,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 48,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 57,
        "col": 9
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 65,
        "col": 9
      }
    ]
  },
  {
    "outcome_id": "TR:6:T.Y.6.1",
    "code": "T.Y.6.1",
    "statement": "Yazma sürecini yönetebilme a) Amaç, bağlam ve olanaklarını analiz ederek yazma konusunu, hedef kitlesini, dijital de dâhil yazma aracı ve ortamını belirler. b) Yazılı etkileşiminde yazışmayı başlatma, sürdürme ve sonlandırmayla ilgili uygun selam ve hitap ifadelerini kullanır. c) Yazılı üretim ve yazılı etkileşiminde içerik ve süreçle ilgili gerekli seçim ve düzenlemeleri yapar. T.Y.6.2. Yazma strateji, yöntem ve tekniklerine yönelik seçimlerini yönetebilme a) Yazma şekli (etkileşimli veya etkileşimsiz), amacı, bağlamı ve olanakları doğrultusunda kullanacağı stratejileri seçer. b) Yazma şekli (etkileşimli veya etkileşimsiz), amacı, bağlamı ve olanakları doğrultusunda kullanacağı yöntem ve teknikleri seçer. T.Y.6.3. Yazısında içerik ve yapıya yönelik seçimlerini yönetebilme a) Yazma amacına uygun paragraf türünü seçer. b) Yazma amacına uygun metin yapısını seçer. T.Y.6.18. Yazısını zenginleştirecek biçimde söz varlığını kullanabilme a) Kullanacağı söz varlığı unsurlarını aralarındaki anlam ilişkilerini dikkate alarak belirler. b) Aynı anlamı farklı söz varlığı unsurlarıyla (eş ve yakın anlamlı kelime, zıt anlamlı ve eş sesli kelime, çağrıştırdığı kelime; atasözü, deyim, kalıp söz, terim, ikileme, pekiştirme) ifade eder. c) Söz varlığı unsurlarını bağlama uygun kullanır. ç) Gerektiğinde yazısında söz varlığı unsurlarının görsel karşılığını kullanır. T.Y.6.21. Yazım kuralları ve noktalama işaretlerini uygulayabilme a) Yazım kurallarını uygular. b) Noktalama işaretlerini uygun biçimde kullanır. T.Y.6.22. Yazma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Yazma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak yazar kimliğinin gelişimine yön verir. c) Yazılarından oluşan ürün ve seçki dosyası (sözlük, günlük, anı, gezi, şiir, alıntılar seçkisi, atasözü ve deyim vb.) oluşturur.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DİLİMİZİN ZENGİNLİĞİ",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 18,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 21,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 29,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 35,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 48,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 57,
        "col": 10
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 65,
        "col": 10
      }
    ]
  },
  {
    "outcome_id": "TR:6:SDB1.1",
    "code": "SDB1.1",
    "statement": "Kendini Tanıma (Öz Farkındalık Becerisi) SDB1.2. Kendini Düzenleme (Öz Düzenleme Becerisi) SDB1.3. Kendini Uyarlama (Öz Yansıtma Becerisi) SDB2.1. İletişim SDB2.2. İş Birliği SDB3.2. Esneklik",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "DİLİMİZİN ZENGİNLİĞİ",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 4,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 18,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 21,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 29,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 35,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 48,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 57,
        "col": 13
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 65,
        "col": 13
      }
    ]
  },
  {
    "outcome_id": "TR:6:T.D.6.2",
    "code": "T.D.6.2",
    "statement": "Dinlemede/izlemede strateji ve yöntem seçimlerini yönetebilme a) Dinleme/izleme şekli (etkileşimli veya etkileşimsiz), amacı, ilgi ve ihtiyaçları; materyalin özellikleri ve etkinliğin süresi doğrultusunda kullanacağı strateji ve yöntemleri seçer. b) Seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.D.6.3. Dinleyeceğinin/izleyeceğinin içeriğine yönelik tahminde bulunabilme a) Dinleyeceğinin/izleyeceğinin başlık, görsel ve/veya belirli bir bölümünden hareketle içerikle ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) İçerik veya sonraki bölümlerle ilgili mantıklı tahminde bulunur. c) Tahmininin doğruluğunu kontrol edip yargıya ulaşır. T.D.6.6. Görselle iletilen anlamı belirleyebilme a) Görseldeki unsurlardan hareketle anlama ilişkin ipuçlarını bulup ön bilgileriyle bağlantı kurar. b) Görselde doğrudan ve/veya örtük olarak iletilen mesajı belirler. c) Gerektiğinde görselle iletilen mesaja uygun tepkiyi verir. T.D.6.7. Dinlediğinin/izlediğinin derin anlamını belirlemeye yönelik basit çıkarımlar yapabilme a) Dinlediğinin/izlediğinin sınırlı bir bölümünden kanıt toplayıp ön bilgileriyle ilişkilendirir. b) İlişkilendirmeden hareketle çıkarım yapar. c) Bir yargıya vararak gerektiğinde tepki verir. T.D.6.8. Dinlediğinin/izlediğinin derin anlamını belirlemeye yönelik üst düzey çıkarımlar yapabilme a) Dinlediğinin/izlediğinin bütününden kanıt toplayıp ön bilgileriyle ilişkilendirir. b) İlişkilendirmeden hareketle çıkarım yapar. c) Bir yargıya vararak gerektiğinde tepki verir. T.D.6.9. Dinlediğini/izlediğini kendi içinde karşılaştırabilme a) İçeriğin farklı bölümlerindeki karşılaştırılabilir unsurlara (duygu, düşünce, görüş, kahraman, dil kullanımı vb.) ilişkin özellikleri belirler. b) Belirlenen özelliklerden hareketle benzerlikleri listeler. c) Belirlenen özelliklerden hareketle farklılıkları listeler. T.D.6.11. Dinlediğindeki/izlediğindeki unsurları sınıflandırabilme a) Sınıflandırma ölçütlerini belirler. b) Dinlediğindeki/izlediğindeki unsurları belirlediği ölçütlere göre ayrıştırır. c) Ayrıştırılan unsurları ayırt edici özelliklerden hareketle tasnif eder. ç) Tasniflerini ölçütlerden hareketle adlandırır/etiketler. T.D.6.25. Dinleme/izleme sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Dinleme/izleme sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak dinleyici/izleyici kimliğinin gelişimine yön verir.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "BAĞIMSIZLIK YOLU",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 18,
        "col": 7
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 48,
        "col": 7
      }
    ]
  },
  {
    "outcome_id": "TR:6:T.O.6.3",
    "code": "T.O.6.3",
    "statement": "Okumada strateji ve yöntem seçimlerini yönetebilme a) Faaliyetin amacını, ilgi ve ihtiyaçlarını, materyalin özelliklerini, süre ve bilgiye erişim olanaklarını analiz ederek görüş oluşturur. b) Analiz sonuçları doğrultusunda okurken kullanacağı strateji ve yöntemleri seçer ve seçimleri üzerinde zamana veya üst bilişsel izlemeye bağlı düzenlemeler yapar. T.O.6.5. Metinde geçen anlamını bilmediği söz varlığı unsurlarının anlamını tahmin edebilme a) Metnin bağlamından söz varlığı unsurlarının anlamıyla ilgili ipuçlarını belirleyip ön bilgileriyle ilişkilendirir. b) Söz varlığı unsurlarının anlamına ilişkin mantıklı tahminde bulunur. c) Tahminin doğruluğunu kaynaklardan (sözlük, başvuru kitapları), ebeveyn veya öğretmenden yardım alarak kontrol edip yargıya ulaşır. T.O.6.8. Metnin derin anlamını belirlemeye yönelik basit çıkarımlar yapabilme a) Metnin sınırlı bir bölümünden ve görselden kanıt toplayıp ön bilgileriyle ilişkilendirir. b) İlişkilendirmeden hareketle çıkarım yapar. c) Bir yargıya vararak gerektiğinde tepki verir. T.O.6.9. Metnin derin anlamını belirlemeye yönelik üst düzey çıkarımlar yapabilme a) Metnin bütününden ve görsellerden kanıt toplayıp ön bilgileriyle ilişkilendirir. b) İlişkilendirmeden hareketle çıkarım yapar. c) Bir yargıya vararak gerektiğinde tepki verir. T.O.6.10. Metin içi karşılaştırma yapabilme a) Metnin farklı bölümlerindeki karşılaştırılabilir unsurlara (duygu, düşünce, görüş, kahraman, dil kullanımı vb.) ilişkin özellikleri belirler. b) Belirlenen özelliklerden hareketle benzerlikleri listeler. c) Belirlenen özelliklerden hareketle farklılıkları listeler. T.O.6.11. Metinler arası karşılaştırma yapabilme a) Metinlerdeki karşılaştırılabilir unsurlara ilişkin özellikleri belirler. b) Belirlenen özelliklerden hareketle benzerlikleri listeler. c) Belirlenen özelliklerden hareketle farklılıkları listeler. T.O.6.12. Metindeki unsurları sınıflandırabilme a) Sınıflandırma ölçütlerini belirler. b) Metindeki unsurları belirlediği ölçütlere göre ayrıştırır. c) Ayrıştırılan unsurları ayırt edici özelliklerden hareketle tasnif eder. ç) Tasniflerini ölçütlerden hareketle adlandırır/etiketler. T.O.6.23. Okuduğunu özetleyebilme a) Metinde sunulan bilgileri çözümler. b) Çözümlemeden hareketle önemli ve önemsiz bilgileri sınıflandırır. c) Metindeki önemli bilgileri kronolojik akışa/düşünce akışına uygun olarak kendi cümleleriyle ifade eder. T.O.6.27. Okuma sürecine yönelik öz yansıtma yapabilme/kendini uyarlayabilme a) Okuma sürecindeki güçlü ve gelişmeye açık yönlerini gerekçelendirerek kendisini değerlendirir. b) Deneyimlediği süreçteki gelişmeye açık yönlerini destekleyecek tedbirler alıp güçlü yönlerini sonraki çalışmalara aktararak okur kimliğinin gelişimine yön verir.",
    "grade": "6",
    "subject_code": "TR",
    "subject_name": "Türkçe",
    "theme_or_unit": "BAĞIMSIZLIK YOLU",
    "sources": [
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 12,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 18,
        "col": 8
      },
      {
        "file": "Türkçe Dersi Yıllık Planlar/2025-2026_Turkçe_Taslak_Çerçeve_Yillik_Plan.xlsx",
        "sheet": "6. SINIF ÇERÇEVE YILLIK PLAN",
        "row": 48,
        "col": 8
      }
    ]
  }
]