[
  {
    "outcome_id": "DE:5:DE.5.1.H1.1",
    "code": "DE.5.1.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für das Hör/Sehverstehen zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ vorbereiten, um vertraute Redemittel, Namen, Buchstaben und Fragen zum Befinden zu erkennen und zu deuten. DE.5.1.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ erkennen und verstehen. DE.5.1.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können die phonologischen Zielstrukturen zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ spontan, authentisch und angemessen in der mündlichen Kommunikation mit anderen erkennen, auswählen und anwenden. DE.5.1.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für Leseverstehen zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ vorbereiten und zentrale Informationen durch schnelles Lesen erfassen. DE.5.1.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können die Bedeutung einfacher Texte aus dem Alltag (z. B. Steckbrief, Dialog) durch genaues Lesen verstehen. Sie reflektieren anschließend ihre Gedanken und Eindrücke und können eigene Texte verfassen und präsentieren. DE.5.1.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den Zielwortschatz zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ sicher erkennen, auswählen und anwenden. Sie können diesen Wortschatz spontan, altersgerecht und kommunikativ angemessen verwenden. DE.5.1.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können die grammatischen Zielstrukturen zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ spontan, authentisch und situationsgerecht erkennen und anwenden – ohne explizite Regelkenntnisse. DE.5.1.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich auf einfache Schreibaufgaben vorbereiten und eigene kurze schriftliche Inhalte passend zum Thema „Ich und Du“ verfassen. Sie lernen, persönliche Informationen strukturiert und korrekt aufzuschreiben und mit anderen zu teilen. DE.5.1.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich auf einfache mündliche Äußerungen zu den Themen „Sich vorstellen“, „Das Alphabet“ und „Nach dem Befinden fragen“ vorbereiten. DE.5.1.SP3.3. - Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können kurze Aussagen und einfache Dialoge situationsgerecht organisieren und gelernte Redemittel in neuen Kommunikationssituationen anwenden.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 4,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:5:DE.5.2.H1.1",
    "code": "DE.5.2.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf den Prozess für Hör-und Sehverstehen zu den Themen „Das Alter und Zahlen“, „Die Länder und die Sprachen“ sowie „Die Herkunft und der Wohnort“ vorbereiten, um relevante Redemittel, Zahlenangaben, Herkunftsländer, Sprachen und Wohnorte zu erkennen und zu deuten. DE.5.2.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können beim Zuhören/Zusehen wichtige Informationen und Details zu den Themen „Das Alter und Zahlen“, „Die Länder und die Sprachen“ sowie „Die Herkunft und der Wohnort“ erkennen und verstehen. DE.5.2.P3.1. - Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können die lautlichen Merkmale (Aussprache, Betonung und Intonation) zu den Themen Alter, Zahlen, Länder, Sprachen, Herkunft und Wohnort korrekt und bewusst erkennen. Sie können diese Kenntnisse in einfachen Kommunikationssituationen angemessen anwenden. DE.5.2.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich gezielt auf das Leseverstehen zu einfachen Texten über Alter, Zahlen, Herkunft, Länder und Sprachen vorbereiten, indem sie ihr Vorwissen aktivieren und erste inhaltliche Vermutungen auf Grundlage von Textmerkmalen anstellen. DE.5.2.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen einfacher Texte zu den Themen Alter, Länder, Sprachen, Herkunft und Wohnort zentrale Informationen erkennen und verstehen. Sie können zudem eigene Gedanken und Eindrücke zum Gelesenen formulieren und austauschen. DE.5.2.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den themenspezifischen Wortschatz zu Alter, Zahlen, Ländern, Sprachen, Herkunft und Wohnort erkennen, verstehen und diesen im eigenen Sprachgebrauch angemessen, spontan und altersgerecht anwenden. DE.5.2.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grammatikalische Strukturen wie Personalpronomen, konjugierte Formen von sein und kommen, sowie einfache Fragesätze erkennen und in altersgerechten Kommunikationssituationen korrekt, authentisch und spontan anwenden. DE.5.2.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich auf das Schreiben eines kurzen Vorstellungstextes vorbereiten, analysieren ein Modell, verfassen eigene Texte und können die gelernten Strukturen und Inhalte in unterschiedlichen Schreibkontexten anwenden. DE.5.2.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich auf einfache Sprechsituationen vorbereiten, indem sie die Modellbeispiele verstehen und die zentralen Redemittel aktivieren. DE.5.2.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können eine strukturierte Selbstdarstellung formulieren und präsentieren. Sie können die gelernten sprachlichen Mittel flexibel in neuen Gesprächssituationen anwenden und ihre Erfahrungen im Sprechen reflektieren.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 12,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 15,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 20,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:5:DE.5.3.H1.1",
    "code": "DE.5.3.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich auf das Hör/Sehverstehen zum Thema Familienmitglieder und Berufe in der Familie vorbereiten, indem sie ihr Vorwissen aktivieren und anhand von Bildern und Kontexten Vermutungen äußern. DE.5.3.H1.2. - Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können zentrale Informationen zum Thema Familie und Berufe von Familienmitgliedern durch bedeutende Details beim Zuhören oder Zuschauen erfassen. DE.5.3.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können die lautlichen Besonderheiten der thematischen Wörter zum Thema Familie und Berufe von Familienmitgliedern erkennen und wenden diese beim Sprechen korrekt, bewusst und verständlich an. DE.5.3.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich auf das Leseverstehen vorbereiten, indem sie ihr Vorwissen zu Familienmitgliedern und Berufen aktivieren und anhand von Bildern oder Titeln erste Vermutungen zum Textinhalt anstellen. DE.5.3.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen einfacher Texte zu den Themen Familie und Berufe zentrale Informationen erkennen und verstehen. Sie sollen eigene Gedanken und Schlussfolgerungen zum Gelesenen formulieren und austauschen. DE.5.3.W2.1. - Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können gezielt den Wortschatz zu Familienmitgliedern erkennen oder verwenden und die Berufe von Familienangehörigen im altersgerechten, kommunikativen Kontext verstehen und verwenden. DE.5.3.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen erkennen und verwenden, um Familienmitglieder zu benennen, einfache Beziehungen auszudrücken und Berufe korrekt in Sätzen darzustellen. DE.5.3.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich auf das Schreiben einfacher Vorstellungstexte über ihre Familie vorbereiten und aktivieren relevantes Vorwissen. Sie können eigene strukturierte Texte mit korrekten sprachlichen Mitteln verfassen. DE.5.3.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich auf einfache Gesprächssituationen über ihre Familie vorbereiten und aktivieren ihr Vorwissen um sich an Modelltexten zu orientieren. DE.5.3.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können einen Sprechbeitrag zur Vorstellung ihrer Familie planen und präsentieren. Sie können die gelernten sprachlichen Mittel flexibel in neuen Gesprächssituationen anwenden und ihre Sprecherfahrungen reflektieren.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 23,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 31,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:5:DE.5.4.H1.1",
    "code": "DE.5.4.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich gezielt auf das Hör- und Sehverstehen zum Thema Schulsachen, Klassenzimmer, Schulräume vorbereiten, indem sie ihr Vorwissen aktivieren und erste Vermutungen äußern. DE.5.4.H1.2. - Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können zentrale Informationen aus Hör- oder Sehtexten durch gezieltes Zuhören und Beobachten erfassen. DE.5.4.P3.1. – Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können zentrale lautliche Merkmale des Wortschatzes zum Thema Schulsachen, Klassenzimmer, Schulräume korrekt, bewusst und verständlich im mündlichen Sprachgebrauch erkennen und verwenden. DE.5.4.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können sich auf den Prozess für das Leseverstehen zu den Unterthemen Schulsachen, Klassenzimmer und Schulräume vorbereiten, indem sie ihr Vorwissen aktivieren, visuelle Hinweise deuten und erste Vermutungen zum Textinhalt formulieren. DE.5.4.L2.3. – Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können beim Lesen einfacher Texte über Schule zentrale Informationen zusammenführen. Sie können Bedeutungen im Lesetext erschließen und eigene Gedanken und Eindrücke formulieren und austauschen. DE.5.4.W2.1. - Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können den themenbezogenen Wortschatz aus dem schulischen Alltag kontextbezogen erkennen und verwenden sie sinnvoll in einfachen Sätzen und Aufgabenformaten. DE.5.4.G1.1. - Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatikalische Strukturen erkennen und anwenden, um Gegenstände und Räume in der Schule zu beschreiben. Sie können kurze Aussagen und Fragen im Präsens formulieren und passende Artikel sowie Possessivpronomen anwenden. DE.5.4.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können sich gezielt auf das Schreiben einfacher Aussagen und kurzer Texte zum Thema „Meine Schule“ vorbereiten, indem sie Wortschatz und Satzmuster aktivieren und strukturierte Planungshilfen nutzen. Anschließend können sie kurze strukturierte Texte zu Schulsachen und Schulräumen verfassen. DE.5.4.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich auf einfache Gesprächssituationen über Schulsachen und Schulräume vorbereiten und einfache Frage- und Antwortstrukturen üben. DE.5.4.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können kurze Dialoge über ihre Schule führen, persönliche Aussagen machen und Informationen präsentieren. Sie können ihre mündlichen Fähigkeiten reflektieren.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 37,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 39,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:5:DE.5.5.H1.1",
    "code": "DE.5.5.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können sich auf das Hör/Sehverstehen vorbereiten, indem sie ihr Vorwissen zu Schulfächern, Wochentagen und Tageszeiten aktivieren, wichtige Begriffe identifizieren und gezielte Erwartungen an den Inhalt entwickeln. DE.5.5.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können zentrale Informationen aus einem Text für Hör- oder Sehverstehen verstehen, indem sie wichtige Details zu Schulfächern, Tagen und Zeiten gezielt herausfiltern und in Zusammenhang setzen. DE.5.5.P3.1. - Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können charakteristische Lautverbindungen, Silbenbetonungen und Intonationsmuster im Zusammenhang mit Wochentagen, Tageszeiten und Schulfächern erkennen und üben. Sie können damit ihre Aussprache und Hörwahrnehmung verbessern. DE.5.5.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können ihr Vorwissen zu Wochentagen, Schulfächern und Tageszeiten aktivieren und bereiten sich auf das Leseverstehen durch gezielte Beobachtung und Erwartungshaltung vor. DE.5.5.L2.3. –Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können gezielt Informationen aus Texten über Stundenpläne, Schulfächer und Tagesabläufe erfassen. Sie können Inhalte vergleichen, eigene Meinungen äußern und ihr Textverständnis reflektieren. DE.5.5.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können zielgerichtet den thematischen Wortschatz zu Schulfächern, Wochentagen, Tageszeiten und Stundenplänen im schriftlichen und mündlichen Sprachgebrauch erkennen und verwenden. DE.5.5.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen im Zusammenhang mit dem Schulalltag erkennen und sie können diese in einfachen Sätzen korrekt anwenden. DE.5.5.S4.1. – Vorbereitung auf den Schreibprozess Lernziel: Die Schüler können einfache schriftliche Texte zu ihrem Stundenplan und zu ihren Schulfächern planen und verfassen. Sie können dabei gelernte Strukturen und Wortschatz korrekt anwenden und stellen persönliche Vorlieben dar. DE.5.5.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich und gedanklich auf die mündliche Kommunikation zum Thema „Schulalltag“ vorbereiten und können den relevanten Wortschatz aktivieren. DE.5.5.SP3.3. –Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können über ihren Stundenplan und Schulalltag sprechen, einfache Dialoge führen und ihre mündliche Leistung reflektieren.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 50,
        "col": 6
      }
    ]
  },
  {
    "outcome_id": "DE:5:DE.5.6.H1.1",
    "code": "DE.5.6.H1.1",
    "statement": "– Vorbereitung auf das Hör- und Sehverstehen Lernziel: Die Schüler können ihr Vorwissen zu Sportarten aktivieren und die Bild- und Hörimpulse einordnen. Sie können erste Vermutungen über den Inhalt des Materials für Hör/Sehverstehen erstellen. DE.5.6.H1.2. – Informationen zusammenführen durch bedeutende Details Lernziel: Die Schüler können gezielt zentrale Informationen zu verschiedenen Sportarten, Spielern, Meinungen oder sportlichen Aktivitäten hören bzw. sehen. DE.5.6.P3.1. - Phonologische Elemente erkennen und anwenden Lernziel: Die Schüler können lautliche Merkmale typischer Sportbegriffe erkennen und können die Aussprache sowie die Satzmelodie in einfachen Mitteilungen zum Thema Sport üben. DE.5.6.L2.1. – Vorbereitung auf das Leseverstehen Lernziel: Die Schüler können ihr Vorwissen zu Sportarten und Lieblingssportarten aktivieren und bereiten sich auf den Leseprozess mit visuellen und sprachlichen Hinweisen vor. DE.5.6.L2.3. –Bedeutung erschließen und Gedanken zum Leseprozess ausdrücken Lernziel: Die Schüler können zentrale Informationen zu Personen, Sportarten und sportlichen Vorlieben im Text erkennen, Zusammenhänge verstehen und eigene Gedanken und Bewertungen äußern. DE.5.6.W2.1. – Zielwortschatz erkennen und anwenden Lernziel: Die Schüler können themenspezifischen Wortschatz rund um Sportarten erkennen und beschreiben sportliche Aktivitäten oder sprechen über Vorlieben im Sport. DE.5.6.G1.1. – Zielgrammatik erkennen und anwenden Lernziel: Die Schüler können grundlegende grammatische Strukturen im Zusammenhang mit Sportarten, Personen oder Vorlieben erkennen und wenden diese korrekt in einfachen Aussagen und Fragen an. DE.5.6.S4.1. – Vorbereitung auf den Schreibprozess Die Schüler können sich schrittweise auf das Schreiben einfacher, strukturierter Texte über ihre Sportvorlieben, Sportarten im Alltag oder Teamsportarten vorbereiten und verfassen eigene Texte dazu. DE.5.6.SP3.1. – Vorbereitung auf den Sprechprozess Lernziel: Die Schüler können sich sprachlich und inhaltlich auf Gespräche über Sportarten und sportliche Vorlieben vorbereiten und stellen einfache Fragen dazu. DE.5.6.SP3.3. – Inhalt für das Sprechen organisieren und anwenden Lernziel: Die Schüler können über sportliche Aktivitäten in Partnerarbeit sprechen, die Ergebnisse präsentieren und ihre mündlichen Leistungen reflektieren.",
    "grade": "5",
    "subject_code": "DE",
    "subject_name": "Almanca",
    "theme_or_unit": null,
    "sources": [
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 59,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 67,
        "col": 6
      },
      {
        "file": "ÇYDEM Almanca Dersi Yıllık Planlar-/2025-2026_TYMM_Cerceve_Yillik_Plan_ALMANCA tamamı.xlsx",
        "sheet": "5.Sınıf",
        "row": 68,
        "col": 6
      }
    ]
  }
]